Repository: bonitasoft/bonita-ui-designer-artifact-builder
Catalog: artifact-builder/src/main/resources/i18n/lang-template-*.po
Languages: es_es

source: If a Business Object has been dropped, a user interface is generated for you. You can either keep it as is, modify it, or remove it if it does not fit your needs.
es_es: Si un Business Object ha sido arrastrado, se generará una interfaz de usuario para usted. Puede dejarla como está, modificarla o eliminarla si no se ajusta a sus necesidades.

source: If checked, this popup will not be displayed again unless you clean up your browser cache
es_es: Si está marcado, este popup no se mostrará nuevamente a menos que se limpie la caché del navegador

source: If the page is displayed inside an iframe, a JavaScript postMessage will be sent to the <b>parent</b> frame with the status of the response and the properties values of the button widget. Bonita portal, tasklist or the default application layout handle this message differently:
es_es: Si la página se muestra dentro de un iframe, se enviará un postMessage en JavaScript al marco <b>padre</b> con el estado de la respuesta y los valores de las propiedades del widget Button. El Bonita portal, la lista de tareas o el layout por defecto de las aplicaciones manejan este mensaje de manera diferente:

source: If the standard widget does not meet your needs, you can create a custom widget to match exactly what you want to. To do this, clone the standard widget by saving it with a different name, and modify it. After creation, the custom widget is available in the palette for designing pages, forms, layouts or fragments.
es_es: Si el widget estándar no satisface sus necesidades, puede crear un widget personalizado para coincidir exactamente con lo que desea. Para ello, clonar el widget estándar guardandolo con un nombre diferente, y modificarlo. Después de la creación, el widget personalizado está disponible en la paleta para diseñar páginas, formularios, layouts o fragmentos.

source: If you choose 'no', HTML code will be escaped instead of being interpreted in row's cells. If you choose ‘Yes’, this could potentially lead to HTML injections attacks. Please take into account these risks.
es_es: Si elige 'no', el código HTML será escapado en lugar de ser interpretado en las celdas de las filas. Si elige "Sí", esto podría provocar ataques de inyecciones HTML. Por favor, tenga en cuenta estos riesgos.

source: If you choose 'no', HTML code will be escaped instead of being interpreted. If you choose 'Yes', this could potentially lead to HTML injections attacks. Please take into account these risks.
es_es: Si elige 'no', el código HTML será escapado en lugar de ser interpretado en las celdas de las filas. Si elige "Sí", esto podría provocar ataques de inyecciones HTML. Por favor, tenga en cuenta estos riesgos.

source: If you choose 'no', HTML code will be escaped instead of being interpreted. If you choose ‘Yes’, this could potentially lead to HTML injections attacks. Please take into account these risks.
es_es: Si elige 'no', el código HTML será escapado en lugar de ser interpretado en las celdas de las filas. Si elige "Sí", esto podría provocar ataques de inyecciones HTML. Por favor, tenga en cuenta estos riesgos.

source: If you create your own user interface, bind your Business data variable on widget properties or use your variable in javascript expressions. Be careful, by default each business data variable is an array (even if only one result from query is returned).
es_es: Si crea su propia interfaz de usuario, vincule su variable Business Data con las propiedades del widget o utilice su variable en expresiones javascript. Tenga cuidado, por defecto, cada variable de Business Data es una colección (incluso si sólo se devuelve un unico resultado en la consulta).

source: If you specify an expression, the result must be an array of strings
es_es: Si especificas una expresión, el resultado debe ser un array de strings

source: Image or Localization assets are not imported in index.html. So we don't need to reorder them.
es_es: Los assets de imagen o localización no se importan en index.html. Por lo tanto no necesitamos reordenarlos.

source: Import
es_es: Importar

source: Import a UI Designer artifact
es_es: Importar un artefacto del UI Designer

source: Import error
es_es: Error de importación

source: Import error: incompatible artifact
es_es: Error de importación: artefacto incompatible

source: Import the moment.js library as an external asset.
es_es: Importa la librería moment.js como un activo externo.

source: Import this JavaScript file as a local page asset.
es_es: Importa este archivo JavaScript como un recurso de página local.

source: Import {{ ::importReport.name }}
es_es: Importar {{ ::importReport.name }}

source: Import, define or deploy a Business Data Model in Bonita Studio.
es_es: Importar, definir o desplegar un Modelo de Datos de Negocio (BDM) en Bonita Studio.

source: Improvements on the widget switch
es_es: Mejoras en el cambio de widgets

source: In 'CSS Classes' property add the <code>zebra-custom</code> class
es_es: En la propiedad 'Clases CSS', agregar la clase <code>zebra-custom</code>

source: In 'CSS Classes' property add the following class <code>zebra-custom</code>
es_es: En la propiedad "CSS Classes" agregar la clase <code>zebra-custom</code>

source: In 'Classes CSS' property add the following value
es_es: En la propiedad 'Clases CSS', agregar el siguiente valor

source: In a JavaScript asset, you can specify a dependency on an Angular module. First add the JavaScript asset, and then add the module name in the dedicated section. You can find the the available modules on <a href="http://ngmodules.org/">http://ngmodules.org/</a>.
es_es: En un recurso JavaScript, puede especificar una dependencia de un módulo Angular. Primero agrega el recurso JavaScript y luego añada el nombre del módulo en la sección dedicada. Puede encontrar los módulos disponibles en <a href="http://ngmodules.org/"> http://ngmodules.org/</a>.

source: In a form, a page, or a layout, we recommend to drop modal containers at the bottom of the editor content.
es_es: En un formulario, página, o layaout, le recomendamos añadir los contenedores modales al final del editor.

source: In a process form, if you have defined business variables in your process, use the link to the variable to retrieve using the context variable:
es_es: En un formulario de proceso, si se han definido variables de negocio en el proceso, utilice el enlace a la variable que se quiere recuperar usando la variable de contexto:

source: In addition to the <em>Successful response value</em> variable, for the <em>POST</em>,<em>PUT</em>,<em>DELETE</em>, <em>Start process</em> and <em>Submit task</em> requests you also have the possibility to define a <em>Target URL on success</em> that will be used to set the current window (frame) location when the request is successful.
es_es: Además de la variable <em>Valor de respuesta exitosa</em>, para las peticiones <em>POST</em>, <em>PUT</em>, <em>DELETE</em>, <em>Iniciar proceso</em> y <em>Enviar tarea</em>, también es posible definir una <em>Dirección URL de destino en éxito</em> que se utiliza para establecer la ubicación actual de la ventana (frame) cuando la solicitud es exitosa.

source: In case your application is not available, please log in using a different account
es_es: En caso de que tu aplicación no esté disponible, por favor inicia sesión usando una cuenta diferente

source: In folder:
es_es: En la carpeta:

source: In production, if the user is logged into Bonita Portal, UI artifacts are displayed in the Portal language selected by the user or in the browser locale.
es_es: En producción, si el usuario está logueado en el Bonita Portal, los artefactos del UI Designer se muestran en el idioma del Portal seleccionado por el usuario o en la configuración regional del navegador (locale).

source: In some case, you want override your theme to display <b>one specific table</b>, to do this:
es_es: En caso de que desee remplazar el tema para mostrar <b>una tabla específica</b>, puede hacer esto:

source: In some case, you want to override your theme to display <b>one</b> data-table with specific line color, to do this:
es_es: En caso de que desee remplazar el tema para <b>una tabla especifica</b>, puede realizar lo siguiente:

source: In some cases, other types of variables are created: <ul> <li> When the business variable is edited in the form (as specified in the contract creation wizard), a UI Designer variable is created for each variable (External API). <br>For example, if the contract input has been created from a business variable 'invoice' in the process, a variable <code>invoice</code> is created in the form and its URL is set to <span ng-non-bindable>../{{context.invoice_ref.link}}</span>. <br>If <code>invoice</code> contains lazy relations, additional variables are generated for each lazy relation to resolve (using <em>lazyRef</em> filter). <br>For example, if 'invoice' has a 'customer' relation in lazy, an External API variable <code>invoice_customer</code> is added. Its URL is set to <span ng-non-bindable>{{invoice|lazyRef:'customer'}}</span>.</li> <li>To display an aggregated object, a Select widget is generated to display the <em>available values</em> of the object. The variable (External API) bound to the widget is created. It queries the BDM. <br>For example, when the object Invoice has an aggregated object Customer, a variable <code>customer_query</code> is created with URL: <span ng-non-bindable>../API/bdm/businessData/com.company.model.Customer?q=find&p=0&c=99</span>. By default it uses the <code>find</code> query with a default pagination (only first 100 objects are returned).</li> </ul>
es_es: En algunos casos, otros tipos de variables son creadas: <ul><li>Cuando una variable de negocio es editada en el formulario (ya que es especificada en el wizard de creación del contrato), una variable UI Designer se crea por cada variable (External API).<br>Por ejemplo, si la entrada de contrato ha sido creada desde una variable de negocio 'invoice' en el proceso, una variable <code>invoice</code> se creara en el formulario y su URL se configurará como <span ng-non-bindable>../{{context.invoice_ref.link}}</span>. <br> si <code>invoice</code> contiene relaciones lazy, otras variables se generaran por cada relación lazy a resolver (usando el filtro <em>lazyRef</em>). <br> Por ejemplo, si 'invoice' tiene un 'customer' en relación lazy, una variable de tipo External API <code>invoice_customer</code> se creará. Su URL estará configurada como <span ng-non-bindable>{{invoice|lazyRef:'customer'}}</span>.</li> <li>Para mostrar un objeto agregado, un widget Select será generado para mostrar los <em> valores disponibles</em> del objeto. La variable (External API) ligada al widget se creará. Llamara al BDM. Por ejemplo, cuando el objeto Invoice tieen un objeto agregado de tipo Customer, una variable <code>customer_query</code> se crea con la URL: <span ng-non-bindable>../API/bdm/businessData/com.company.model.Customer?q=find&p=0&c=99</span>. Por defecto usa la consulta <code>find</code> con la paginación por defecto (solo los 100 primeros objetos serán devueltos).</li></ul>

source: In tab title properties add the following value
es_es: En las propiedades del título de la pestaña añadir el siguiente valor

source: In the Asset list, you can manually change the order of CSS and Javascript page assets. Reorder this files can be useful to override some css classes or javascript functions.
es_es: En la lista de Assets, puede cambiar manualmente el orden de los assets de CSS y Javascript. Reordenar estos archivos pueden ser útil para reemplazar algunas clases css o funciones javascript.

source: In the Studio, a form must be linked to a process or a task, using the contract; a page is linked to an application descriptor.
es_es: En el Studio, un formulario debe estar vinculado a un proceso o una tarea, utilizando el contrato; una página está vinculada a un descriptor de la aplicación.

source: In the Switch wizard, select or type the widget to switch to, then click <b>Show properties</b>.<br> Whenever possible, properties in the source widgets are mapped with similar properties in the target widget. You can edit that or map more, then click on <b>Switch</b>.
es_es: En el asistente, seleccione o busque el widget a cambiar, luego haga clic en <b>Mostrar propiedades</b>.<br> Siempre que sea posible, las propiedades en los widgets de origen se mapean con propiedades iguales en el widget de destino. Puede editar o mapear más, luego haga clic en <b>Cambiar</b>.

source: In the context of a form container, use $form.$invalid as a Boolean to check form validity in a widget property
es_es: En el contexto de un contenedor de formulario, utilice $form.$invalid como un valor booleano para comprobar la validez del formulario en una propiedad del widget

source: In the fragment editor, you can set the scope of a variable to <i>specific to this fragment</i> or to <i>exposed to the page</i>.
es_es: En el editor de fragmentos, puedes establecer el ámbito de una variable como <i>específico de este fragmento</i> o <i>expuestos a la página</i>.

source: In the preview and at runtime, the displayed text will adapt automatically to the selected language.
es_es: En la vista previa y en tiempo de ejecución, el texto se adaptará automáticamente al idioma seleccionado.

source: In the scope of a page, form, or layout, a variable can be used to handle business data, or can contain structural information that determines how page elements behave.
es_es: En el ámbito de una página, formulario o layout, una variable se puede utilizar para manejar datos de negocios, o puede contener información estructural que determina el comportamiento de los elementos de la página.

source: In this list, you can use the arrows to reorder assets, view local assets, edit external assets, and delete any.
es_es: En esta lista, puede utilizar las flechas para reordenar los recursos, ver los recursos locales, editar recursos externos y eliminar cualquiera de ellos.

source: Includes the localized version of the Technical date format property, to guide the user
es_es: Incluye la versión localizada de la propiedad Formato de fecha técnica, para guiar al usuario

source: Includes the localized version of the Technical time format property, to guide the user
es_es: Incluye la versión localizada de la propiedad Formato de hora técnica, para guiar al usuario

source: Incorrect zip structure.
es_es: Estructura zip incorrecta.

source: Inline
es_es: En línea

source: Input field with content completion from a given list
es_es: Campo de entrada con autocompletado basado en una lista dada

source: Input: <a href='https://en.wikipedia.org/wiki/ISO_8601' target='_blank'>ISO 8601</a> formatted String (yyyy-MM-dd), Date object or Long number <br>Output: Date object (see widget help)
es_es: Entrada: String con formato <a href='https://en.wikipedia.org/wiki/ISO_8601' target='_blank'>ISO 8601</a> (yyyy-MM-dd), objeto Date o número Long <br>salida: objeto Date (consulte la ayuda del widget)

source: Integer value which contains the debounce model update value in milliseconds. A value of 0 triggers an immediate update. Debounce value cannot be changed once initialized.
es_es: Valor entero que contiene el valor de actualización del modelo en milisegundos. Un valor de 0 activa una actualización inmediata. El valor de desconexión no se puede cambiar una vez inicializado.

source: Integration with Bonita platform
es_es: Integración con Bonita Platform

source: Interpolation
es_es: Interpolación

source: Interpret HTML
es_es: Interpretar HTML

source: Interpret HTML default properties
es_es: Interpretar propiedades predeterminadas de HTML

source: Interpret HTML in label
es_es: Interpretar HTML en la etiqueta

source: Interpret HTML in tab heading
es_es: Interpretar HTML en el encabezado de la pestaña

source: Invalid URL: it must only contain alphanumeric character or #!:.?+=&%@-/
es_es: URL no válida: sólo debe contener caracteres alfanuméricos o #!:.? += y%@-/

source: Invalid {{ infos.modelfile }} json file structure
es_es: Estructura de archivos json no válida {{ infos.modelfile }}

source: It is now possible to define the tab that will be selected by default in the tab group with the new "Selected" field on the tabs.
es_es: Ahora es posible definir la pestaña que se seleccionará por defecto en el grupo de pestañas con el nuevo campo "Seleccionado" en las pestañas.

source: It is now possible to easily bind the metadata of an API variable response (header, status code, and response value) to other variables
es_es: Ahora es posible enlazar fácilmente los metadatos de una respuesta de variable API (header, status code y valor de respuesta) a otras variables

source: It is possible to deactivate the animation when the modal appears. The main usage of this option would be to create a wizard, where several modal containers are displayed in a sequence.
es_es: Es posible desactivar la animación de entrada de la modal. El uso principal de esta opción es para crear un wizard o asistente, es decir, cuando varios contenedores se van a mostrar en secuencia.

source: It provides references to all business variables and documents in the process instance (case). To retrieve a business variable instance, create an External API variable with value
es_es: Otorga las referencias a todas las variables de negocio y documentos de la instancia de proceso (caso). Para recuperar la instancia de una variable de negocio, crea una variable de tipo API externo con valor

source: Item to remove
es_es: Elemento a eliminar

source: JSON Source model
es_es: Modelo JSON Source

source: JSON descriptor to exchange between UI Designers
es_es: Descriptor JSON para el intercambio entre UI Designers

source: JSON specifications can be found on the
es_es: Las especificaciones de JSON se pueden encontrar en

source: Javascript expression
es_es: Expresión JavaScript

source: Label
es_es: Etiqueta

source: Label hidden
es_es: Etiqueta oculta

source: Label position
es_es: Posición de Etiqueta

source: Label width
es_es: Ancho de etiqueta

source: Labels
es_es: Etiquetas

source: Large devices (width ≥ 1200px)
es_es: Dispositivos grandes (tamaño ≥ 1200px)

source: Last
es_es: Último

source: Last Update:
es_es: Última actualización:

source: Lazy reference filter
es_es: Filtro de referencia Lazy

source: Legend hidden
es_es: Leyenda oculta

source: Level 1
es_es: Nivel 1

source: Level 2
es_es: Nivel 2

source: Level 3
es_es: Nivel 3

source: Level 4
es_es: Nivel 4

source: Level 5
es_es: Nivel 5

source: Level 6
es_es: Nivel 6

source: Line
es_es: Fila

source: Link
es_es: Enlace

source: Link to display or download a document
es_es: Enlace para visualizar o descargar un documento

source: Linked to a process instantiation or a task, using the contract
es_es: Vinculado a una instanciación de proceso o una tarea, utilizando el contrato

source: Linked to an application descriptor.
es_es: Vinculado a un descriptor de aplicación.

source: List from column keys
es_es: Lista de claves de columna

source: List of cases open for a process definition id
es_es: Lista de casos abiertos por un identificador de definición de proceso

source: List of human task in ready state for current user (pending + assigned)
es_es: Lista de tareas humana en estado ready para el usuario actual (pendiente + asignado)

source: Living data
es_es: Datos variables

source: Loading {{mode}}...
es_es: Cargando {{mode}}...

source: Localization
es_es: Localización

source: Long number values (Milliseconds since epoch)
es_es: Valores numéricos Long (en milisegundos desde Epoch)

source: Look what you're missing
es_es: Mira lo que te estás perdiendo

source: MM/dd/yyyy
es_es: dd/MM/yyyy

source: Make sure the technical format value and its translations is a valid <a href="https://code.angularjs.org/1.3.18/docs/api/ng/filter/date" target="_blank">date format</a>.
es_es: Asegúrese de que el valor de formato técnico y sus traducciones corresponde a un <a href="https://code.angularjs.org/1.3.18/docs/api/ng/filter/date" target="_blank">formato de fecha</a> válido.

source: Make sure the technical format values and their translations are valid <a href="https://code.angularjs.org/1.3.18/docs/api/ng/filter/date" target="_blank">date/time formats</a>.
es_es: Asegúrese de que los valores de formato técnico y sus traducciones corresponden a <a href="https://code.angularjs.org/1.3.18/docs/api/ng/filter/date" target="_blank">formatos de fecha/hora</a> válidos.

source: Malformed json file
es_es: Archivo json con formato incorrecto

source: Manual detection
es_es: Detección manual

source: Mark as favorite
es_es: Marcar como favorito

source: Max value
es_es: Valor máximo

source: Medium devices (width ≥ 992px)
es_es: Dispositivos medianos (tamaño ≥ 992px)

source: Message
es_es: Mensaje

source: Metadata
es_es: Metadatos

source: Method
es_es: Método

source: Migrate
es_es: Migrar

source: Migration
es_es: Migración

source: Migration enhancements
es_es: Mejoras de Migración

source: Migration notes
es_es: Notas Migración

source: Migration report
es_es: Informe de Migración

source: Milliseconds since Epoch (number or string variable)
es_es: Milisegundos desde Epoch (variable numérica o string)

source: Min value
es_es: Valor mínimo

source: Minified widgets JavaScript for optimized performance
es_es: Widgets JavaScript miniaturizados para un rendimiento optimizado

source: Miscellaneous toolbar
es_es: Barra de herramientas Miscelánea

source: Modal container
es_es: Contenedor modal

source: Modals
es_es: Modales

source: Move asset down
es_es: Mover asset hacia abajo

source: Move asset up
es_es: Mover asset hacia arriba

source: Move the row down
es_es: Bajar la fila

source: Move the row up
es_es: Subir la fila

source: Multi-line, expandable, text input field
es_es: Campo de entrada de texto multilínea, extensible,

source: Multiple content for tabs container
es_es: Contenido múltiple para el contenedor de pestañas

source: Multiple groups of widgets, each group in a tab
es_es: Varios grupos de widgets, cada grupo en una pestaña

source: Multiple screen size
es_es: Múltiples tamaños de pantalla

source: Multiple set charts
es_es: Gráficas de conjunto múltiple

source: Name
es_es: Nombre

source: Name must be less than {{maxlength}} characters long
es_es: El nombre debe ser menor que {{maxlength}} caracteres

source: Name must contains only alphanumeric characters with no space
es_es: El nombre debe contener sólo caracteres alfanuméricos sin espacio

source: Navigation link to another page or form
es_es: Enlace a otra página o formulario

source: New window (_blank)
es_es: Nueva ventana (_blank)

source: Next page to display, for applications. In the Portal, it is ignored as navigation is managed automatically
es_es: Página siguiente para mostrar, en las aplicaciones. En el Portal, se ignora ya que la navegación se gestiona automáticamente

source: No Bonita REST API calls.
es_es: No hay llamadas de la API REST de Bonita.

source: No Business Data Model currently deployed.
es_es: No hay ningún modelo de datos de negocio (BDM) actualmente desplegado.

source: No application selected
es_es: Ninguna aplicación seleccionada

source: No artifact found.
es_es: Ningún artefacto encontrado.

source: No variable
es_es: Sin variables

source: No web resources
es_es: No hay recursos web

source: No {{label}} asset (no scope selected).
es_es: No hay {{label}} asset (no se ha seleccionado ningún ámbito).

source: No {{label}} asset at page level.
es_es: No hay {{label}} asset a nivel de página.

source: No {{label}} asset at widget level.
es_es: No hay {{label}} asset en el nivel del widget.

source: No {{label}} asset.
es_es: No hay {{label}} asset.
