Repository: bonitasoft/bonita-ui-designer-artifact-builder
Catalog: artifact-builder/src/main/resources/i18n/lang-template-*.po
Languages: es_es

source: '{{ctrl.newData.$$name}}' already exists
es_es: '{{ctrl.newData.$$name}}' ya existe

source: '{{newData.$$name}}' already exists
es_es: Ya se utiliza '{{newData.$$name}}'

source: (displayed in editor's property panel)
es_es: (se muestra en el panel Propiedades del editor)

source: (used in your template and controller)
es_es: (utilizado en su plantilla y controller)

source: <a href="https://en.wikipedia.org/wiki/ISO_8601" target="_blank">ISO 8601</a> String variables (with or without time information)
es_es: Variables String con formato <a href="https://en.wikipedia.org/wiki/ISO_8601" target="_blank">ISO 8601</a> (con o sin información de tiempo)

source: <b><em>Now</em> button</b> sets the selected date and time to the current date and time for the user. For the time, it is rounded up or down to the closest 5 min value.
es_es: <b>El botón <em>Ahora</em></b> establece la fecha y hora actuales para el usuario como la fecha y hora seleccionada. Por el momento, se redondea hacia arriba o hacia abajo para el valor más cercano de 5 min.

source: <b><em>Today</em> button</b> sets the selected date to the current date for the user. It doesn't change the selected time, except when the time is not set. In that case, it's rounded up or down to the closest 5 min value.
es_es: <b>El botón <em>Hoy</em></b> establece la fecha actual del usuario como la fecha seleccionada. No cambia la hora seleccionada, excepto cuando la hora no se ha establecido. En ese caso, redondea hacia arriba o abajo el valor más cercano en 5 minutos.

source: <b>Checklist and Radiobuttons</b> internal HTML have been updated to follow some accessibility recommendation
es_es: <b>Lista de control y Radiobuttons</b> HTML interno han sido actualizados para seguir algunas recomendaciones de accesibilidad

source: <b>Note</b>: Custom-widget assets are only editable in widget editor. You can't modify them at page level to avoid side effects on other pages. So if you want to reorder custom-widget assets, please go to widget editor.
es_es: <b>Nota</b>: Los assets de widget personalizado sólo son editables en el editor de widget. No puede modificarlos a nivel de página para evitar efectos secundarios en otras páginas. Así que si desea reordenar los assets de widget personalizado, por favor vaya al editor de widget.

source: <b>To update a form during production</b>, export the form from the UI Designer, import it into the relevant process in the portal, and then map it to the relevant task or process start event.
es_es: <b>Para actualizar un formulario en producción</b>, exporte el formulario desde el UI Designer, impórtelo en el proceso correspondiente en el portal y luego asígnelo a la tarea o evento de inicio de proceso.

source: <b>To use a form in a process</b>, map it in the studio to the relevant process or human task. It will be automatically packaged in the .bar archive ready to deploy in the portal.
es_es: <b>Para utilizar un formulario en un proceso</b>, mapéalo en el Studio con el proceso o tarea humana correspondientes. Será automáticamente empaquetado en el archivo .bar y estará listo para desplegarse en el portal.

source: <b>To use a layout in a business application</b>, export it from the UI Designer, import it into the portal as a resource and map it as the layout of the relevant application.
es_es: <b>Para utilizar un layout en una aplicación de negocio</b>, expórtalo desde el UI Designer, impórtalo en el Bonita BPM Portal como recurso y mapéalo en el layout de la aplicación correspondiente.

source: <b>To use a page in a business application</b>, export it from the UI Designer, import it into Bonita Portal resources, and from the relevant application, add it to the list of pages and to a navigation menu.
es_es: <b>Para utilizar una página en una aplicación de negocio</b>, expórtala desde el UI Designer, impórtala en el Bonita Portal como recurso y añádela a la lista de páginas y de menús de la aplicación correspondiente.

source: <b>UI Designer version</b>: {{ctrl.getUidVersion()}} - <b>Model version</b>: {{ctrl.getModelVersion()}}
es_es: <b>UI Designer versión</b>: {{ctrl.getUidVersion()}} - <b>Model versión</b>: {{ctrl.getModelVersion()}}

source: <b>With <em>Handle time zone</em> set to "no"</b>: User time zone is ignored and the value of the widget does not contain any time zone information (e.g., yyyy-MM-ddTHH:mm:ss).
es_es: <b>Con <em>Manejar zona horaria</em> establecida en "no"</b>: la zona horaria del usuario se ignora y el valor del widget no contiene ninguna información de zona horaria (por ejemplo, yyyy-MM-ddTHH:mm:ss).

source: <b>With <em>Handle time zone</em> set to "yes"</b>: the <em>Value</em> of the widget is in UTC (e.g., yyyy-MM-ddTHH:mm:ssZ).
es_es: <b>Con <em>Manejar zona horaria</em> establecida en "si"</b>: el <em>Valor</em> del widget es en UTC (por ejemplo, yyyy-MM-ddTHH:mm:ssZ).

source: <b>{{ctrl.artifact.name}}</b> successfully migrated.
es_es: <b>{{ctrl.artifact.name}}</b> migrado correctamente.

source: <b>{{ctrl.artifact.name}}</b> was migrated from <b>{{ctrl.migrationReport.previousArtifactVersion}}</b> to <b>{{ctrl.migrationReport.newArtifactVersion}}</b> with some warning.
es_es: <b>{{ctrl.artifact.name}}</b> fue migrado de <b>{{ctrl.migrationReport.previousArtifactVersion}}</b> a <b>{{ctrl.migrationReport.newArtifactVersion}}</b> con alguna advertencia.

source: <b>{{ctrl.artifact}}</b> {{ctrl.type}} has been created in an older version of the UI Designer. It needs to be migrated to the current version to be used with the latest features. This migration is automatic. <br> Note that once migrated, the page cannot be brought back to its previous state, and cannot be used in a previous version of the UI Designer.
es_es: <b>{{ctrl.artifact}}</b> {{ctrl.type}} ha sido creado en una versión anterior del UI Designer. Necesita ser migrado a la versión actual para ser utilizado con las últimas características. Esta migración es automática. <br> Tenga en cuenta que una vez migrada, la página no puede ser traída de vuelta a su estado anterior, y no puede ser utilizada en una versión anterior del UI Designer.

source: <code>Bordered</code><em>(Default: no)</em>: Display cells with border.
es_es: <code>Bordered</code><em>(Por defecto: desactivado)</em>: Muestra las celdas con bordes.

source: <code>Bordered</code><em>(Defaults: no)</em>: Display cells with border.
es_es: <code>Bordered</code><em>(Por defecto: desactivado)</em>: Muestra las celdas con bordes.

source: <code>Condensed</code><em>(Default: no)</em>: Display cells without spacing.
es_es: <code>Condensed</code><em>(Por defecto: desactivado)</em>: Muestra las celdas sin espaciado interlinea.

source: <code>Condensed</code><em>(Defaults: no)</em>: Display cells without spacing.
es_es: <code>Condensed</code><em>(Por defecto: desactivado)</em>: Muestra las celdas sin espacio interlínea.

source: <code>Selected</code> <em>(Default: first tab is selected)</em>: Whether the tab is selected or not
es_es: <code>Seleccionado</code> <em>(por defecto: primera pestaña es seleccionada)</em>: Si la pestaña está seleccionada o no

source: <code>Title</code>: can be calculated dynamically to display and <b>render html</b>.
es_es: <code>Título</code>: se puede calcular dinámicamente para mostrar y <b>renderizar html</b>.

source: <code>Zebra-striping</code><em>(Default: yes)</em>: Apply a Zebra style (this style set a different background color on even and odd lines).
es_es: <code>Zebra-striping</code><em>(Por defecto: activado)</em>: Aplica un estilo "Cebra" (colores diferentes para lineas alternantes).

source: <code>Zebra-striping</code><em>(Defaults: yes)</em>: Apply a Zebra style (this style set a different background color on even and odd lines).
es_es: <code>Zebra-striping</code><em>(Por defecto: activado)</em>Aplica un estilo "Cebra" (Un color diferente para lineas intercaladas).

source: <code>context</code> is an External API.
es_es: <code>context</code> es una External API.

source: <code>cssClasses</code> <em>(Default: none)</em>: Add css classes on tab. This css class will be attached to <strong>tab-heading</strong> html element.
es_es: <code>cssClasses</code> <em>(Por defecto: Ninguna)</em>: Agrega clases Css de encabezados. Esta clase Csss será asociada al elemento Html <strong>Encabezado de Columna</strong>.

source: <code>disabled</code> <em>(Default: no)</em>: Whether tab is clickable and can be activated.
es_es: <code>deshabilitado</code> <em>(por defecto: no)</em>: Si la pestaña es clicable y puede ser activada.

source: <code>formInput</code> is a JSON object. <br>Its structure is defined by the contract inputs and the attributes are initialized with default values. It could be used to set initial values for form fields. <br>You can set the values in <code>formInput</code> either by editing the default values with constants (useful for test and debug) or with values from an object in an external source that has the same model (such as with a BDM external API). <br>You can also set the initial values of a form from some other source without using <code>formInput</code>. However, you will then have to edit <code>formOutput</code> manually.
es_es: <code>formInput</code> es un objeto JSON. <br>Su estructura está definida por las entradas de contrato y los atributos se inicializan con los valores predeterminados. Podría ser utilizado para establecer los valores iniciales de los campos del formulario. <br>Se pueden establecer los valores en <code>formInput</code> ya sea editando los valores predeterminado con valores constantes (útiles para prueba y depuración) o con valores de un objeto en una fuente externa que tenga el mismo modelo (como con una API externa BDM). <br>También se pueden establecer los valores iniciales de un formulario desde alguna otra fuente sin utilizar <code>formInput</code>. Sin embargo, entonces tendrás que editar <code>formOutput</code> manualmente.

source: <code>formOutput</code> is a JavaScript expression returning an object. <br>Its structure matches the contract requirements and is filled with <code>formInput</code> by default. Its goal is to aggregate the fields from the form and to submit them to the task or process to fulfil the contract. On Submit, values entered or modified by the end-user and aggregated in the <code>formOutput</code> object (as defined by the <i>Data sent on click</i> property of the Submit button) are submitted to the process or task
es_es: <code>formOutput</code> es una expresión de JavaScript que devuelve un objeto. <br>Su estructura coincide con los requisitos del contrato y está rellenada con el <code>formInput</code> por defecto. Su objetivo es agregar los campos del formulario y enviarlos a la tarea o proceso para cumplir con el contrato. Al Enviar, los valores añadidos o modificados por el usuario final y agregados en el objeto <code>formOutput</code> (como se define en <i>Datos enviados al hacer clic</i>, propiedad del botón de Enviar) se envían al proceso o a la tarea

source: <code>hidden</code> <em>(Default: no)</em>: Whether tab is hidden or not.
es_es: <code>hidden</code> <em>(Por defecto: desactivado)</em>: En caso que la pestaña esté oculta o no.

source: <code>submit_errors_list</code> is a JavaScript expression formatting the response payload to html when a submit fails.
es_es: <code>submit_errors_list</code> es una expresión JavaScript formateando el payload de la respuesta a html cuando un envío falla.

source: <code>taskId</code> is a URL Parameter. <br>It is the id of the current BPM task. You can use it as a BPM API parameter.
es_es: <code>taskId</code> es un parámetro de URL. <br>Es el id de la tarea actual de BPM. Se puede utilizar como un parámetro de la API de BPM.

source: <em><b>Example</b></em>: use the key <em>button.submit.name</em> on the <b>Label</b> property of a submit button. Use the key <em>date.format</em> on the <b>Date format</b> property and <em>date.placeholder</em> on the <b>Placeholder</b> property on a Date Picker widget. Then, change the <em>localization.json</em> asset to add the <em>button.submit.name</em>, <em>date.format</em> in English, <em>date.placeholder</em> translations.
es_es: <em><b>Ejemplo</b></em>: Utilice la clave <em>button.submit.name</em> en la propiedad <b>Etiqueta</b> del botón Enviar. Use la clave <em>date.format</em> en la propiedad <b>formato de fecha</b> y <em>date.placeholder</em> en la propiedad de <b>placeholder</b> en un widget selector de fecha (datepicker). Luego, cambie el recurso <em>localization.json</em> para agregar las traducciones en inglés de <em>button.submit.name</em>, <em>date.format</em>, <em>date.placeholder</em>.

source: <em>Add to collection</em> or <em>Remove from collection</em> actions can be used to prepare the data before sending it to the server (e.g. if you have a process/task contract with an input that is multiple). No request will be sent to the server. The button will just update the <em>Collection</em> data which must be a variable of type array (<code>[]</code> in JSON).
es_es: Las acciones <em>Añadir a la colección</em> o <em>Eliminar de la colección de</em> pueden utilizarse para preparar los datos antes de enviarlos al servidor (por ejemplo, si usted tiene un contrato de tarea/proceso con una entrada que es múltiple). Ninguna petición se enviará al servidor. El botón sólo actualizará los datos de la <em>colección</em> que deben ser una variable de tipo array (<code>[]</code> en JSON).

source: <em>DATE (NOT RECOMMENDED)</em> (based on <code>java.util.Date</code>)
es_es: <em>DATE (NOT RECOMMENDED)</em> (basado en <code>java.util.Date</code>)

source: <em>DATE ONLY</em> (based on <code>java.time.LocalDate</code>)
es_es: <em>DATE ONLY</em> (basado en <code>java.time.LocalDate</code>)

source: <em>DATE-TIME (NO TIME ZONE)</em> (based on <code>java.time.LocalDateTime</code>): set the property <em>Handle time zone</em> to "No"
es_es: <em>DATE-TIME (NO TIME ZONE)</em> (basado en <code>java.time.LocalDateTime</code>): establezca la propiedad de <em>Manejar la zona horaria</em> a "no"

source: <em>DATE-TIME (TIME ZONE)</em> (based on <code>java.time.OffsetDateTime</code>): set the property <em>Handle time zone</em> to "Yes"
es_es: <em>DATE-TIME (TIME ZONE)</em> (basado en <code>java.time.OffsetDateTime</code>): establezca la propiedad de <em>Manejar la zona horaria</em> a "si"

source: <em>Failed response value</em>: the variable will be set if the request is unsuccessful (code 4XX)
es_es: <em>Valor de la respuesta fallida</em>: la variable se establecerá si la petición no tiene éxito (código 4XX)

source: <em>Note about the</em> Date Picker <em>and</em> Date Time Picker <em>widgets:</em> the <em>Placeholder</em> property translations must match the <em>Technical format</em> property values (order and number of letters). However, the <em>Placeholder</em> key should be different from the <em>Technical format</em> key to avoid translations mismatches.
es_es: <em>Nota sobre los widgets</em> Selector de fecha <em>y</em> Selector de fecha y hora <em>:</em> las traducciones de la propiedad de <em>Placeholder</em> deben coincidir con el valor de las propiedades <em>Formato de fecha</em> (orden y número de letras). Sin embargo, la clave <em>Placeholder</em> debe ser diferente de la clave <em>Formato técnico de fecha</em> para evitar desajustes de las traducciones.

source: <em>Successful response value</em>: the variable will be set if the request is successful (code 2XX)
es_es: <em>Valor de la respuesta exitosa</em>: la variable se establecerá si la petición es exitosa (código 2XX)

source: <i class="fa fa-warning"></i>&nbsp;By convention, the file has to be named <em>localization.json</em>
es_es: <i class="fa fa-warning"></i>&nbsp;Por Convención, el archivo tiene que llamarse <em>localization.json</em>

source: <i>context.myDocument_ref</i> or <i>myVar.myDocument_ref</i>
es_es: <i>context.myDocument_ref</i> o <i>myVar.myDocument_ref</i>

source: <p><span class="tip">Tips:</span></p> <ul> <li translate>To get data from the <i>Business Data Model</i>, please use the Business data variable type. </li> <li translate>You can use data in the URL with the <i><em ng-non-bindable>{{dataName}}</em></i> syntax. </li> <li translate>You can extend our REST API capabilities by creating REST API extensions in the Studio and use them here. </li> <li translate>You can retrieve the Status Code or Response Headers with a usual variable binding and use it in the artifact. </li> </ul>
es_es: <p><span class="tip">Consejos:</span></p> <ul> <li translate>Para obtener datos del <i>Modelo de Datos de Negocio</i>, por favor utilice el tipo de variable de datos de negocio. </li> <li translate>Puede utilizar datos en la URL con la sintaxis <i><em ng-non-bindable>{{dataName}}</em></i> . </li> <li translate>Puedes ampliar nuestras capacidades de la API REST creando extensiones de la API REST en el Studio y usarlas aquí. </li> <li translate>Puede recuperar el código de estado o las cabeceras de la respuesta con una variable normal y usarlo en el artefacto. </li> </ul>

source: <span class="tip">Tip:</span> Array syntax: ["val1", "val2"], Object syntax: {"key": "value"}
es_es: <span class="tip"> Consejo:</span> Sintaxis Array : ["val1", "val2"], Sintaxis Object: {"clave": "valor"}

source: <span class="tip">Tip:</span> Hit <span class="key">$</span> key to access data, use ctrl-space to trigger autocomplete.
es_es: <span class="tip"> Consejo:</span> Teclea<span class="key"> $</span> para acceder a los datos, utilizar ctrl-espacio para desencadenar el auto-completado.

source: <span class="tip">Tip:</span> URL parameters are located after a <em>?</em> in the page URL.
es_es: <span class="tip"> Consejo:</span> El parámetro de URL se encuentran después de un <em>?</em> en la Url de la página.

source: <span>Create a new variable</span>
es_es: <span>Crear una nueva variable</span>

source: <span>Declare Bonita resource</span>
es_es: <span>Declarar recurso Bonita</span>

source: <strong>$collection</strong>: the current collection
es_es: <strong>$collection</strong>: la colección actual

source: <strong>$index</strong>: the index of the current iteration of the collection (counting from zero)
es_es: <strong>$index</strong>: el índice de la iteración actual de la colección (contando desde cero)

source: <strong>$item</strong>: the element of the current iteration
es_es: <strong>$item</strong>: el elemento de la iteración actual

source: <strong>{{newData.businessObject.name}}</strong> doesn't exist in the Business Data Model currently deployed.
es_es: . <strong>{{newData.businessObject.name}}</strong> no existe en el Modelo de Datos de Negocio actualmente desplegado.

source: A <a href='https://en.wikipedia.org/wiki/ISO_8601' target='_blank'>ISO 8601</a> formatted String variable yyyy-MM-ddTHH:mm:ss(Z)
es_es: Variable de tipo String formateada según <a href='https://en.wikipedia.org/wiki/ISO_8601' target='_blank'> ISO 8601</a>: aaaa-MM-ddTHH:mm:ss(Z)

source: A Bonita REST API URL
es_es: Una URL al API REST de Bonita

source: A Business data variable is reloaded every time the filter value changes.
es_es: Una variable de datos de negocio se recarga cada vez que el valor del filtro cambia.

source: A JSON object
es_es: Un objeto JSON

source: A TabsContainer is a container that has multiple panes, but shows only one pane at a time.
es_es: Un contenedor de tabs es un contenedor que tiene múltiples paneles, pero sólo muestra un panel a la vez.

source: A binding is dynamic, so every time data changes, all variables are re-evaluated and the UI is updated. In consequence:
es_es: Un enlace es dinámico, por lo que cada vez que cambian los datos, todas las variables son reevaluadas y el UI se actualiza. En consecuencia:

source: A configuration wizard appears: create a Business Data variable by providing information on how to retrieve elements of this Business Object.
es_es: Aparecerá un asistente de configuración: cree una variable Business Data proporcionando información sobre cómo recuperar elementos de este Business Object.

source: A filter area is displayed, depending on your selection, you may have to enter one or several attribute values. You can use a variable to fill its value using interpolation syntax.
es_es: Se muestra un área de filtro, dependiendo de su selección, puede que tenga que introducir valores en uno o varios atributos. Puede utilizar una variable como valor usando la sintaxis de interpolación.

source: A local asset name must not contain special characters or spaces. An external asset name must be a standard URL.
es_es: El nombre de un recurso local no debe contener espacios o caracteres especiales. Un nombre de recurso externo debe ser una URL estándar.

source: A modal container cannot be located in another container. Recommendation: drop all modal containers at the bottom of the whiteboard.
es_es: Un contenedor modal no se puede ubicar en otro contenedor. Recomendación: coloca todos los contenedores modales en la parte inferior de la pizarra.

source: A modal container doesn't work when it is embedded in another container.
es_es: Un contenedor modal no funciona si esta embebido en otro contenedor.

source: A multiple set chart shows one or more set of data
es_es: Un gráfico conjunto múltiple muestra uno o más conjuntos de datos

source: A new widget is now available to display our data with currency
es_es: Un nuevo widget está ahora disponible para mostrar nuestros datos con moneda

source: A property that requires a constant value is presented in the Properties panel as a radio button set, drop-down list, or number selector (for the Width property). Select the required value.
es_es: Una propiedad que requiere un valor constante se presenta en el panel de propiedades como un grupo de radio buttons, lista desplegable o selector de números (para la propiedad Width). Selecciona el valor deseado.

source: A property value is constant, dynamic, a bidirectional bond, or an interpolation.
es_es: Un valor de propiedad es constante, dinámico, de un vínculo bidireccional o una interpolación.

source: A server error occurred.
es_es: Se produjo un error de servidor.

source: A single entry will be created in the LocalStorage identified by the form URL.
es_es: Se creará una única entrada en el LocalStorage identificado por la URL del formulario.

source: A variable initialized with a JavaScript expression is executed when the page is loaded. Then, when one of its dependencies changes, its value is updated. Dependencies are created using <code>$data.XXX</code>.
es_es: Una variable que se inicializa con una expresión de JavaScript se ejecuta cuando se carga la página. Entonces, cuando una de sus dependencias cambia, se actualiza su valor. Las dependencias se crean utilizando <code>$data.XXX</code>.

source: A variable initialized with an External API is reloaded every time the URL value changes.
es_es: Una variable inicializada con una API externa se vuelve a cargar cada vez que cambia el valor de URL.

source: A variable that contains a JSON array (single set) or JSON array of arrays (multiple sets) where each array is a set. The data can be obtained by a BDM query, API call (default or extension), or JavaScript that retrieves and formats external data
es_es: Una variable que contiene un array JSON (conjunto simple) o un array de arrays JSON (conjunto múltiple) donde cada array es un conjunto. Los datos pueden obtenerse por una consulta BDM, llamada al API (por defecto o extensión del API) o por un JavaScript que recupera y formatea variables externas

source: A {{ ::importReport.overwrittenType }} with the same Id as <strong>{{ ::importReport.name }}</strong> already exists.
es_es: Un {{ ::importReport.overwrittenType }} con el mismo Id que <strong>{{ ::importReport.name }}</strong> ya existe.
