Repository: bonitasoft/bonita-ui-designer-artifact-builder
Catalog: artifact-builder/src/main/resources/i18n/lang-template-*.po
Languages: es_es

source: Yes. You must bind this variable to a variable in the page, form, layout or fragment using this fragment.
es_es: Sí. Se debe enlazar esta variable a una variable en la página, formulario, layout o fragmento utilizando este fragmento.

source: You can also create custom widgets, from existing widgets by "saving as" or from scratch in the home page.
es_es: También puede crear widgets personalizados, desde widgets existentes "guardando como" o desde cero en la página de inicio.

source: You can apply it to the following variable value types:
es_es: Se puede aplicar a los siguientes tipos de valor de la variable:

source: You can change the type to be able to use this artifact as a process form or as an application page.
es_es: Puede cambiar el tipo para poder usar este artefacto como un formulario de proceso o como una página de aplicación.

source: You can check the list of all Bonita REST API resources on this dedicated <a href="https://api-documentation.bonitasoft.com/latest/">documentation</a>
es_es: Puede revisar la lista de todos los recursos de la API de Bonita REST en esta <a href="https://api-documentation.bonitasoft.com/latest/">documentación</a> dedicada

source: You can delete page assets only, view local assets, and edit external assets of a page.
es_es: Puede eliminar sólo assets de página, ver assets locales y editar assets externos de una página.

source: You can explore the data model (with a graphical view) using the graph icon in the header of this panel. It shows the relationships between business objects, and their attributes.
es_es: Puede explorar el modelo de datos (con una vista gráfica) usando el icono del gráfico en la cabecera de este panel. Muestra las relaciones entre los objetos de negocio, y sus atributos.

source: You can extend our REST API capabilities by creating REST API extensions in the Studio and use them here.
es_es: Puedes ampliar nuestras capacidades de API REST creando extensiones de API REST en el Studio y usarlas aquí.

source: You can extend our REST API capacities by creating <em>REST API extensions</em> in the Studio <i>Development</i> menu and use them as External API variables in the UI Designer.
es_es: Puede ampliar nuestras capacidades de la API REST creando <em>extensiones de API REST</em> en el menú <i>Desarrollo</i> del Studio y utilizarlas como variables de API externa en el UI Designer.

source: You can format data with filters when data is used in widget property fields that allow interpolation <i class="fa fa-paragraph"></i> or that are bound to a variable <i class="fa fa-link"></i> .
es_es: Puede dar formato a los datos con los filtros cuando los datos se utilizan en campos de propiedades de widget que permiten interpolación <i class="fa fa-paragraph"></i> o que están vinculados a una variable <i class="fa fa-link"></i>.

source: You can group widgets into a container to define the arrangement of widgets in a form or a page. A container can contain other containers.
es_es: Se pueden agrupar widgets en un contenedor para definir la disposición de los widgets en un formulario o en una página. Un fragmento puede contener otros contenedores.

source: You can manually declare the Bonita REST API resources which you're using in your artifact when the automatic detection fails to found them.
es_es: Puede declarar manualmente los recursos de la API Bonita REST que está utilizando en su artefacto cuando la detección automática no los encuentra.

source: You can manually declare the Bonita REST API resources which you're using in your artifact when the automatic detection fails to found them. You need to select an HTTP Verb, and type/choose the REST API on the value field. This Bonita resource will export in page.properties files.
es_es: Puede declarar manualmente los recursos de la API Bonita REST que está utilizando en su artefacto cuando la detección automática no los encuentra. Necesita seleccionar un verbo HTTP, y escribir/elegir la API REST en el campo de valor. Este recurso Bonita exportará en los archivos page.properties.

source: You can only edit the query filters and pagination.
es_es: Sólo puede editar los filtros de consulta y la paginación.

source: You can optimize the UI designer responsiveness behavior for various screen sizes by configuring a different value for the <em>width</em> property for each device type. This uses the Bootstrap CSS grid mechanism.
es_es: Puede optimizar el comportamiento <i>responsive</i> del UI Designer para varios tamaños de pantalla, configurando un valor diferente en la propiedad <em>width</em> para cada tipo de dispositivo. Esto utiliza el mecanismo CSS de Bootstrap.

source: You can provide a filter for users to update the displayed table to show only the rows that match the filter. To do this :
es_es: Puede proporcionar un filtro para que los usuarios actualicen la tabla mostrada para mostrar sólo los registros que coincidan con el filtro. Para hacer esto:

source: You can retrieve the Status Code or Response Headers with a usual variable binding and use it in the artifact.
es_es: Puede recuperar el Código de Estado o las Cabeceras de Respuesta con una variable enlazada habitual y usarlo en el artefacto.

source: You can save the content of a plain container as a reusable fragment.
es_es: Puede guardar el contenido de un contenedor como un fragmento reusable.

source: You can translate all the text displayed on a UI artifact: labels, placeholders, available values of a list. Even the Date format of the Date Picker widget can be localized.
es_es: Puedes traducir todo el texto mostrado en un artefacto del UI Designer: etiquetas, placeholders, los valores disponibles de una lista. Puede ser "localizado" (locale) incluso el formato de fecha del widget Date Picker.

source: You can use Business data type to get a business data object.
es_es: Puede utilizar el tipo Business data para obtener un objeto de negocio.

source: You can use Pagination section to define the number of elements you want by page (by default 10 elements) and the page number (by default first page - index 0). For example, you can bind a variable to get dynamic pagination: {{paginationVariable.pageNumber}}.
es_es: Puede utilizar la sección Paginación para definir el número de elementos que desea por página (por defecto 10 elementos) y el número de página (por defecto primera página - índice 0). Por ejemplo, puede enlazar una variable para obtener una paginación dinámica: {{paginationVariable.pageNumber}}.

source: You can use data in the URL with the <i><em ng-non-bindable>{{dataName}}</em></i> syntax.
es_es: Puede usar variables en la URL con la sintaxis <i><em ng-non-bindable>{{dataName}}</em></i>

source: You can use standard HTML tags and AngularJS built-in directives, scope and interpolation system.
es_es: Puede usar etiquetas HTML estándar y las directivas, scope, interpolación de AngularJS.

source: You can use the <code>API request parameters</code> property to pass additional parameters to the request. Supported parameters are described in the REST API Overview documentation page and in the REST API documentation for the relevant resources.
es_es: Puede utilizar la propiedad <code>API request parameters</code> para pasar parámetros adicionales a la solicitud. Los parámetros soportados se describen en la página de documentación de REST API Overview y en la documentación REST API para los recursos pertinentes.

source: You can use the <i>environment</i> property injected in the scope when inside the whiteboard editor. It allows to create a mockup display for the whiteboard as the real use data will not be available.
es_es: Puede utilizar la propiedad <i>environment</i> inyectada en el scope dentro del editor de la pizarra. Esto permite crear una visualización de la maqueta de la pizarra porque los datos de uso real no están disponibles.

source: You cannot have more than one localization asset. When you upload a new asset file, it overwrites the existing one.
es_es: No puede haber más de un recurso de localización. Cuando subes un archivo de recurso, se sobrescribe el existente.

source: You cannot import or use this artifact in older version anymore.
es_es: Ya no puedes importar o usar este artefacto en la versión anterior.

source: You cannot move, delete or disable <b>Base framework</b> assets. They are here only to show you which library is used to build your artifact
es_es: No puedes mover, eliminar o desactivar assets del <b>framework base </b>. Están aquí sólo para mostrarte qué biblioteca se utiliza para construir tu artefacto

source: You do not need to specify paging parameters (such as ?p=0&c=10), because the data table handles paging automatically when you use a Bonita API data source.
es_es: No necesita especificar parámetros de paginación (como ? =0&c=10), porque la tabla de datos maneja la paginación automáticamente cuando utiliza una fuente de datos de Bonita API.

source: You have unsaved changes. Do you really want to leave ?
es_es: Con cambios sin guardar. ¿Realmente desea salir ?

source: You need to use this following css selector in your theme.css file:
es_es: Necesita utilisar el siguiente selector css en su fichero "theme.css":

source: You should always declare the resource on the most atomic artifact (in fragment, if the resource is used in a fragment, in a custom widget, or at page level)
es_es: Siempre debes declarar el recurso en el artefacto más atómico (en fragmento, si el recurso se utiliza en un fragmento, en un widget personalizado, o a nivel de página)

source: You should start process form design in the studio: from the appropriate pool or human task, create a contract and launch the UI Designer. It will auto-generate a dedicated form to edit.
es_es: Debería iniciar el diseño del formulario de proceso en el Studio: desde la Pool apropiada o tarea humana, crear un contrato y ejecutar el UI Designer. Se auto-generará un formulario concreto para poder editar.

source: You will have to manage the minification and update the resources URL to trigger the cache busting.
es_es: Se debe administrar el miniaturizado y actualizar la URL del recurso para activar el cache-busting.

source: Your artifact was migrated from <b>{{ctrl.migrationReport.previousArtifactVersion}}</b> to model version <b>{{ctrl.migrationReport.newArtifactVersion}}</b>.
es_es: Tu artefacto fue migrado de <b>{{ctrl.migrationReport.previousArtifactVersion}}</b> a la versión del modelo <b>{{ctrl.migrationReport.newArtifactVersion}}</b>.

source: Your artifact was migrated to <b>{{ctrl.migrationReport.newArtifactVersion}}</b>.
es_es: Tu artefacto fue migrado a <b>{{ctrl.migrationReport.newArtifactVersion}}</b>.

source: added
es_es: añadido

source: already exists
es_es: ya existe

source: artifact
es_es: artefacto

source: center
es_es: centrado

source: column
es_es: columnas

source: custom widgets
es_es: Widgets personalizados

source: data model
es_es: modelo de datos

source: desktop screens (1200px ≤ screenSize)
es_es: pantalla escritorio (1200px ≤ tamaño)

source: expression or variable
es_es: expresión o variable

source: form
es_es: formulario

source: formatted String variables
es_es: variables con formato tipo String

source: fragment
es_es: fragmento

source: fragments
es_es: fragmentos

source: h:mm:ss a
es_es: H:mm:ss

source: has been migrated successfully. Check migration details <i class="fa fa-wrench status"></i> for more details.
es_es: ha sido migrado con éxito. Compruebe los detalles de migración <i class="fa fa-wrench status"></i> para más detalles.

source: hidden
es_es: oculto

source: if you edit the page, form or layout outside the UI Designer, you will not be able to reimport it.
es_es: si se edita la página, el formulario o el layout fuera del UI Designer, no se podrá reimportarlo.

source: is not compatible with this UI Designer version. A newer version is required.
es_es: no es compatible con esta versión de UI Designer. Se requiere una nueva versión.

source: laptop screens (992px ≤ screenSize < 1200px)
es_es: pantalla laptop (992px ≤ tamaño< 1200px)

source: large
es_es: grande

source: left
es_es: izquierda

source: link
es_es: enlace

source: medium
es_es: medio

source: mobile screens (screenSize < 768px)
es_es: pantallas móviles (tamaño < 768px)

source: name
es_es: nombre

source: none
es_es: ninguno

source: overwritten
es_es: sobrescrito

source: page
es_es: página

source: right
es_es: derecha

source: small
es_es: pequeño

source: successfully imported.
es_es: importado con éxito.

source: supportTicket is an object composed of a <em>subject</em>, <em>severity</em> level, user <em>environment</em>, reporter’s <em>contact</em> (<em>name</em> and <em>job title</em>), and an <em>URL</em> providing more details on the contact.
es_es: supportTicket es un objeto compuesto por un <em>subject</em>, nivel de <em>severity</em>, <em>entorno</em> de usuario, <em>información de contacto</em> del reportero (<em>nombre</em> y <em>puesto</em>), y una <em>URL</em> que proporciona detalles adicionales sobre el contacto.

source: tablet screens (768px ≤ screenSize < 992px)
es_es: pantallas tablet (768px ≤ tamaño < 992px)

source: top
es_es: Arriba

source: view W3C's Json specification
es_es: ver la especificación Json de W3C

source: whitespace
es_es: espacio blanco

source: widget editor
es_es: editor de widget

source: yes
es_es: sí

source: {{ vm.page.type }} editor
es_es: Editor de {{ vm.page.type }}

source: {{asset.name}} content<expand-modal></expand-modal>
es_es: contenido de {{asset.name}} <expand-modal></expand-modal>

source: {{ctrl.artifact}} requires a migration
es_es: {{ctrl.artifact}} requiere una migración

source: {{ctrl.page.name}} information
es_es: {{ctrl.page.name}} información

source: {{currentLength}} of {{totalNumber}}
es_es: {{currentLength}} de {{totalNumber}}
