Repository: bonitasoft/bonita-ui-designer-artifact-builder
Catalog: artifact-builder/src/main/resources/i18n/lang-template-*.po
Languages: es_es

source: A {{ ::importReport.overwrittenType }} with the same identifier as <strong>{{ ::importReport.name }}</strong> already exists.
es_es: Un {{ ::importReport.overwrittenType }} con el mismo identificador que <strong>{{ ::importReport.name }}</strong> ya existe.

source: A {{type}} asset named <em>{{ name }}</em> is already added to assets.
es_es: Un recurso externo {{type}} con nombre <em>{{ name }}</em> ya ha sido agregado.

source: API Variables response Metadata usage
es_es: Uso de los metadatos de la respuesta de las variables API

source: API request parameters
es_es: Parámetros de la petición API

source: Access to $form capabilities for form container
es_es: Acceso a capacidades $form desde el contenedor de formularios

source: Accessibility
es_es: Accesibilidad

source: Action
es_es: Acción

source: Active
es_es: Activo

source: Add
es_es: Añadir

source: Add CSS assets at page level and use them to edit the CSS classes property of any widget. (UI Designer integrates default Bootstrap style)
es_es: Añadir recursos CSS a nivel de página y utilizar para modificar la propiedad de las clases CSS de cualquier widget. ( El UI Designer integra el estilo por defecto de Bootstrap)

source: Add JavaScript assets for custom scripts. They will be loaded and made available at page level. You can use them in variables of type JavaScript expression. In the value field of the variable, simply call the function and pass the required parameters.
es_es: Añada recursos JavaScript para scripts personalizados. Serán cargados y estarán disponibles a nivel de página. Se pueden utilizar en las variables de tipo Expresión JavaScript. En el campo de valor de la variable, simplemente llame a la función y pase los parámetros requeridos.

source: Add a modal ID, as the button will need to open the right modal container. This ID must be unique within a given page, form, or layout.
es_es: Añada un modal ID, ya que el botón necesita abrir el contenedor modal adecuado. Este ID debe ser único en una página, formulario o layout.

source: Add a new asset
es_es: Añadir un nuevo asset

source: Add a new tab
es_es: Añadir una pestaña nueva

source: Add a widget to the page where the user will specify the filter. This can be an Input widget for free-form text, or a Select widget to choose from a preset list.
es_es: Añade un widget a la página, donde el usuario puede espificar un filtro. Este puede ser un Input Widget con texto en formato libre, o un widget Select para seleccionar de una lista predefinida.

source: Add borders all around the table and between all the columns.
es_es: Añadir contorno alrededor de la tabla y entre todas las columnas.

source: Add images, CSS or JavaScript resources to your pages in the Assets panel at the bottom.
es_es: Añade recursos de imágenes, CSS o JavaScript a tus páginas en la parte inferior del panel de Recursos.

source: Add the following class in style.css asset.
es_es: Añade la siguiente clase en el asset style.css

source: Add to collection
es_es: Añadir a la colección

source: Add/Remove an Object to/from a collection
es_es: Añadir/Eliminar un objeto a/de una colección

source: Added artifacts
es_es: Artefactos agregados

source: Additional request parameters added to the query string
es_es: Parámetros adicionales de la petición añadidos a la cadena de consulta

source: Additional request parameters added to the query string as json or javascript object, by using the related variable type
es_es: Parámetros adicionales de la solicitud añadidos a la cadena de consulta como objeto json o javascript, usando el tipo de variable relacionado

source: Advanced options
es_es: Opciones Avanzadas

source: Alignment
es_es: Alineación

source: Alignment toolbar
es_es: Barra de herramientas de alineación

source: All <a href="https://code.angularjs.org/1.3.18/docs/api/ng/filter" target="_blank">angularJS filters</a> are available. Usage requires the use of <code>|</code> ("pipe"). E.g. <code>myVariable|lowercase</code>.
es_es: Todos los <a href="https://code.angularjs.org/1.3.18/docs/api/ng/filter" target="_blank"> filtros angularJS</a> están disponibles. Para su utilización, use <code>|</code> ("pipe"). Por ejemplo, <code>myVariable | lowercase</code>.

source: All process data of a case: Search for a list of case variables
es_es: Datos de proceso de un caso: Buscar con una lista de variables de caso

source: Already adding from automatic detection, could be deleted
es_es: Ya añadiendo desde detección automática, se pudo eliminar

source: Already declared from another automatic declaration, could be deleted
es_es: Ya declarado de otra declaración automática, podría ser eliminado

source: Alternate text
es_es: Texto alternativo

source: Alternating gray and transparent backgrounds
es_es: Alterna fondo gris y transparente

source: Alternatively, you can set the Data source to Variable and use a variable definition to point to the table content.
es_es: Alternativamente, se puede configurar una fuente de datos a una variable y usar esta definicion para apuntar al contenido de una tabla.

source: Amount
es_es: Cantidad

source: An artifact designed with the UI Designer can be exported to be shared with teammates (import in the UI Designer) or used in business applications (import in Bonita Portal).
es_es: Un artefacto diseñado con el UI Designer puede ser exportado para ser compartido con compañeros de equipo (importar desde el UI Designer) o utilizado en aplicaciones de negocio (importar desde Bonita Portal).

source: An attribute <code>lang</code> is now available. The attribute is based on the <code>BOS_locale</code> cookies at page initialization and will automatically get filled without any user action.
es_es: Un atributo <code>lang</code> ya está disponible. El atributo se basa en las cookies <code>BOS_locale</code> en la inicialización de la página y se rellenará automáticamente sin ninguna acción del usuario.

source: An errors occurs during migration.
es_es: Ha ocurrido un error durante la validación.

source: An extended table widget that provides column sorting, filtering, and paging in addition to the standard table widget capabilities.
es_es: Un widget de tabla extendido que provee ordenado por columnas, filtrado y paginado, adémas de las capacidades del widget de tabla estandar.

source: An {{type}} asset named <em>{{ name }}</em> is already added to assets.
es_es: Un recurso externo {{type}} con nombre <em>{{ name }}</em> ya ha sido agregado.

source: Animation
es_es: Animación

source: Another possibility would be adding different containers inside the modal and specify any of the following classes:
es_es: Otra posibilidad es añadir contenedores diferentes dentro de una modal y especificar una de las clases siguiente:

source: Any accessible CSS classes. By default UI Designer comes with Bootstrap http://getbootstrap.com/css/#helper-classes
es_es: Cualquier clase CSS accesible. Por defecto, el UI Designer viene con Bootstrap http://getbootstrap.com/css/#helper-classes

source: Any boolean variable: <i>myData</i> or <i>myData.attribute</i>
es_es: Cualquier variable booleana: <i>myData</i> ó <i>myData.attribute</i>

source: Any button can close a modal container that contains it when a success happens after any button action.
es_es: Cualquier botón puede cerrar un contenedor modal en el cual esta contenido el botón, si la acción del botón es satisfactoria.

source: Any variable: <i>myData</i> or <i>myData.attribute</i>
es_es: Cualquier variable: <i>myData</i> ó <i>myData.attribute</i>

source: Any variable: myData or myData.attribute.
es_es: Cualquier variable: myData o myData.attribute.

source: Application URL token
es_es: Token de URL de aplicación

source: Application layout
es_es: Layout de la aplicación

source: Application page
es_es: Página de la aplicación

source: Apply a filter to the value of a variable: <em>selectedUser | json</em>
es_es: Aplica un filtro en el valor de una variable: <em>selectedUser | json</em>

source: Are you sure you want to delete <b>{{ctrl.artifact}}</b> {{ctrl.type}} ?
es_es: ¿Estás seguro de eliminar el <b>{{ctrl.artifact}}</b> {{ctrl.type}}?

source: Are you sure you want to delete the {{ artifact.type }} <b>{{ artifact.name }}</b>?
es_es: ¿Estás seguro de eliminar el {{ artifact.type }} <b>{{ artifact.name }}</b>?

source: Array used to populate the table. Can be a list of objects. Use 'Column keys' to refine content
es_es: Matriz utilizada para rellenar la tabla. Puede ser una lista de objetos. Use las 'Claves de Columna' para refinar el contenido

source: Artifact creation:
es_es: Creación de artefactos:

source: As used in the URL after the application token
es_es: Tal como se utiliza en la URL después del token de la aplicación

source: Asset
es_es: Recurso

source: Asset Name
es_es: Nombre del Recurso

source: Asset has not been saved
es_es: No se ha guardado el asset

source: Asset list
es_es: Lista de recursos

source: Asset reordering
es_es: Reordenación de assets

source: Asset use
es_es: Uso de recursos

source: Assets
es_es: Recursos

source: Assets enable you to add web resources to pages and forms. Available asset types are <strong>JavaScript</strong>, <strong>CSS</strong>, <strong>Image</strong> and <strong>Localization</strong>. Assets can be <strong>Local</strong> (file stored into the page artifact) or External (URL). The Localization asset is always local.
es_es: Los recursos externos te permiten añadir recursos web a páginas y formularios. Los tipos disponibles son <strong>JavaScript</strong>, <strong>CSS</strong>, <strong>imagen</strong> y <strong>Localization </strong>. Los recursos externos pueden ser <strong>Locales</strong> (archivos almacenados en el artefacto de la página) o Externos (URL). El recurso Localization siempre es local.

source: Assign before Submit
es_es: Asignar antes de enviar

source: At runtime, CSS and JavaScript assets are loaded in the page header. This loading is done as it's represented in this list, CSS first then Javascript. All assets are loaded in order they are listed, widget assets before page assets (in alphabetical order of the widgets name).
es_es: En tiempo de ejecución, los assets CSS y JavaScript se cargan en la cabecera de la página. Esta carga se hace como está representada en esta lista, CSS primero después Javascript. Todos los assets se cargan para que se listen, los assets de widget antes de los assets de la página (en orden alfabético del nombre de los widgets).

source: At runtime, assets of a custom widget are loaded in the order defined.
es_es: En tiempo de ejecución, los recursos de un widget personalizado se cargan en el orden definido.

source: Attention:
es_es: Atención:

source: Automatic detection
es_es: Detección automática

source: Automatically assign the Task to the current user before the execution
es_es: Asignar automáticamente la tarea al usuario actual antes de la ejecución

source: Available values
es_es: Valores Disponibles

source: Available values: <i>bold, italics, underline, strikeThrough, pre, quote</i>
es_es: Valores disponibles: <i>bold, italics, underline, strikeThrough, pre, quote</i>

source: Available values: <i>h1, h2, h3, h4, h5, h6, p, ul, ol</i>
es_es: Valores disponibles: <i>h1, h2, h3, h4, h5, h6, p, ul, ol</i>

source: Available values: <i>html, insertImage, insertLink, insertVideo, wordcount, charcount, undo, redo, clear</i>
es_es: Valores disponibles: <i>html, insertImage, insertLink, insertVideo, wordcount, charcount, undo, redo, clear<i>

source: Available values: <i>justifyLeft, justifyCenter, justifyRight, indent, outdent</i>
es_es: Valores disponibles: <i>justifyLeft, justifyCenter, justifyRight, indent, outdent</i>

source: Available variables types are string and JSON (static), and External API, Business data, JavaScript expression, and URL parameter (dynamic).
es_es: Los tipos de variables disponibles son string y JSON (estático), y API externa, Business data, expresión JavaScript y parámetro URL (dinámico).

source: BDM APIs are not yet sortable. For other APIs, test in the preview or refer to the BonitaBPM documentation 'REST API' pages
es_es: Las APIs BDM no están clasificadas todavía. Para conocer otras APIs, prueba en la vista previa o consulta las páginas de 'API REST' en la documentación de BonitaBPM

source: Back
es_es: Atrás

source: Back to default size
es_es: Regresar al tamaño predeterminado

source: Base framework
es_es: Framework Base

source: Bidirectional bond
es_es: Enlace bidireccional

source: Bind the <em>formInput</em> variable of your form.
es_es: Vincule las variables <em>formInput</em> del formulario.

source: Bind the filter variable to the Data table widget Filter property.
es_es: Enlaza la variable de filtro a las propiedades filtro del widget Data Table.

source: Bind the filter variable to the widget.
es_es: Enlaza la variable filtro al widget.

source: Bind these options to a UI-Designer variable and use them in your artifact.
es_es: Vincula estas opciones a una variable UI Designer y úsalas en tu artefacto.

source: Bind to a Variable to filter the table 'Content'
es_es: Enlazar una Variable para filtrar el 'Contenido' de la tabla

source: Bindable fragment data
es_es: Datos de fragmento enlazable

source: Bonita Resource is automatically declared
es_es: El recurso Bonita se declara automáticamente

source: Bonita Resource manually declared by user
es_es: Recursos de Bonita declarados manualmente por el usuario

source: Bonita resource
es_es: Recursos de Bonita

source: Bonita resources
es_es: Recursos de Bonita

source: Bordered
es_es: Bordeado

source: Bound data
es_es: Variables enlazadas

source: Business data
es_es: Datos de negocio

source: By convention, in <em>localization.json</em>, the language used for translation keys is English. This means that in the editor whiteboard, any widget default text is currently in English. However, to ease maintenance and update of the UI artifacts in English, you can change the keys into code names and add an <b>en-US</b> section in the <em>localization.json</em> asset file.
es_es: Por convenio, en <em>localization.json</em>, el lenguaje utilizado para las claves de traducción es el inglés. Esto significa que en la pizarra del editor, el texto predeterminado de cualquier widget está actualmente en inglés. Sin embargo, para facilitar el mantenimiento y actualización de los artefactos del UI Designer en inglés, puede cambiar las claves con código de nombres y añadir una sección de <b>en-US</b> en el recurso <em>localization.json</em>.

source: By default, only page assets are displayed. To display others scopes assets, we should check Widget or Base Framework checkbox.
es_es: Por defecto, sólo se muestran los assets de páginas. Para mostrar otros scopes activos, debemos marcar la casilla Widget o Base Framework.

source: CSS classes
es_es: Clases CSS

source: Calendar for selecting a date (only)
es_es: Calendario para seleccionar una fecha (únicamente)

source: Calendar for selecting a date and time
es_es: Calendario para seleccionar una fecha y hora

source: Call a business data (custom) query
es_es: Llama a una query (personalizada) de variables de negocio

source: Can be a list of objects. Use 'Displayed key' to refine options and 'Returned key' to refine selections
es_es: Puede ser una lista de objetos. Use 'clave a a mostrar' para refinar las opciones y la 'clave de retorno' para refinar la selección

source: Can be a list of objects. Use 'Displayed key' to refine suggestions and 'Returned key' to refine selection
es_es: Puede ser una lista de objetos. Use 'clave a a mostrar' para refinar las opciones y la 'clave de retorno' para refinar la selección

source: Can be any string, hence enabling any symbol (€, $, …) or any abbreviation (EUR, USD, …). Numeric characters will be removed on display
es_es: Puede ser cualquier cadena, lo que permite cualquier símbolo (€, $, …) o cualquier abreviación (EUR, USD, …). Los caracteres numéricos se eliminarán en la pantalla

source: Can be translated using the asset localization.json
es_es: Puede traducirse usando el recurso localization.json

source: Can be used to define the expected input format
es_es: Puede utilizarse para definir el formato de entrada previsto

source: Can be used to fulfill a contract
es_es: Se puede utilizar para rellenar un contrato

source: Cancel
es_es: Cancelar

source: Caption
es_es: Nombre

source: Case Id
es_es: Id del caso

source: Case identifier could then be retrieved by {{myData.rootCaseId}}
es_es: El identificador del Caso podría recuperarse con {{myVar.rootCaseId}}

source: Case overview
es_es: Resumen de caso

source: Changes need to be saved to enable the preview
es_es: Se requiere guardar los cambios para habilitar la vista previa

source: Check that the json file structure matches a standard UI Designer export.
es_es: Compruebe que la estructura del archivo json coincide con el archivo estándar del UI Designer exportado.

source: Check that the zip archive contains one of following files {{ infos.modelfiles }}.
es_es: Compruebe que el archivo zip contiene uno de los siguientes archivos {{ infos.modelfiles }}.

source: Check that the zip archive contains the file {{ infos.modelfile }}.
es_es: Compruebe que el archivo zip contiene el archivo {{ infos.modelfile }}.

source: Check that the zip file structure matches a standard UI Designer export.
es_es: Compruebe que la estructura del archivo zip coincide con el archivo estándar del UI Designer exportado.

source: Check the log files
es_es: Compruebe los archivos de log

source: Choices
es_es: opciones

source: Choices (comma separated)
es_es: Opciones (separadas por comas)

source: Choose a business object
es_es: Elija un objeto de negocio

source: Choose process document if the file is used by a process
es_es: Elija el documento del proceso si el archivo se utiliza en un proceso

source: Choose true if you want display this modal with an animation, false otherwise
es_es: Elija verdadero si desea mostrar este modal con una animación, de lo contrario, falso

source: Clear
es_es: Limpiar

source: Clear search
es_es: Limpiar búsqueda

source: Click <em>Add</em> to override.
es_es: Haga clic en <em>Añadir</em> para sobreescribir.

source: Click to see migration report
es_es: Haga clic para ver el informe de migración

source: Close
es_es: Cerrar

source: Close Modal
es_es: Cerrar Modal

source: Close modal
es_es: Cierre modal

source: Close modal on success
es_es: Cierre modal con éxito

source: Close modal when the action is successful
es_es: Cierre modal cuando la acción es exitosa

source: Code
es_es: Código

source: Collection
es_es: Colección

source: Collections
es_es: Colecciones

source: Colors
es_es: Colores

source: Column keys
es_es: Claves de columna

source: Columns key
es_es: Claves de columna

source: Comma-separated list
es_es: Lista separada por comas

source: Comma-separated list or bound an array data
es_es: Lista separada por comas o un array de datos enlazado

source: Comma-separated list or variable
es_es: Lista separada por comas o variable

source: Community edition features
es_es: Características de edición comunitaria

source: Condensed
es_es: Condensado

source: Condensed table with half padding
es_es: Tabla Condensada con medio relleno

source: Configure widgets using the <b>properties panel</b> on the right.
es_es: Configura los widgets mediante el <b>panel de propiedades</b> de la derecha.

source: Confirm deletion
es_es: Confirmar eliminación

source: Constant
es_es: Constante

source: Container used for a form. Eases validation
es_es: Container usado para un formulario. Facilita la validación

source: Containers
es_es: Contenedores

source: Containers cannot be edited.
es_es: No se pueden editar los contenedores.

source: Containers cannot be switched.
es_es: No se pueden cambiar los contenedores.

source: Content
es_es: Contenido

source: Controller can be left empty if not needed.
es_es: El controlador puede dejarse vacío si no es necesario.

source: Convert to ...
es_es: Convertir a...

source: Convert {{ctrl.page.name}}
es_es: Convertir {{ctrl.page.name}}

source: Corrupted zip archive.
es_es: El archivo zip está corrupto.

source: Create
es_es: Crear

source: Create a JSON variable named <code>updateDate</code> to hold a timestamp as a number
es_es: Crea una variable JSON llamada <code>updateDate</code> para mantener un timestamp como un número

source: Create a JavaScript file named <code>date-ago-filter.js</code> that updates the <code>bonitasoft.ui.extensions</code> module with the filter:
es_es: Crear un archivo JavaScript denominado <code>date-ago-filter.js</code> que actualiza el módulo <code>bonitasoft.ui.extensions</code> con el filtro:

source: Create a filter variable in the variable panel. If you are using an Input widget, this variable has no value.
es_es: Crea una variable filtro en el panel de variables. Si usa un Input widget, esta variable no tiene ningún valor.

source: Create a fragment to reuse the same group of widgets with the same behavior in several pages or forms.
es_es: Crea un fragmento para reutilizar el mismo grupo de widgets con el mismo comportamiento en varias páginas o formularios.

source: Create a new UI Designer artifact
es_es: Crear un nuevo artefacto de UI Designer

source: Create a new variable
es_es: Crear una nueva variable

source: Create a user interface to handle "{{ctrl.businessData.name}}"
es_es: Crear una interfaz de usuario para manejar "{{ctrl.businessData.name}}"

source: Create a variable here. Using the variable in a widget property depends on the property value type, described in the page editor general help, in the <i>Properties</i> section.
es_es: Cree una variable aquí. Usar la variable en una propiedad de widget depende del tipo de valor de la propiedad, que se describe en la ayuda general del editor de la página, en la sección <i>Propiedades</i>.

source: Create a variable in the bottom panel. Using a variable in a widget property depends on the property value type, described in the next section.
es_es: Cree una variable en el panel inferior. Utilizar una variable en una propiedad de widget depende del tipo de valor de propiedad, descrito en la sección siguiente.

source: Create an <b>application page</b> directly in the UI Designer
es_es: Crear una <b>Página de aplicación</b> directamente en el UI Designer

source: Create new artifact
es_es: Crear un nuevo artefacto

source: Create new property
es_es: Crear nueva propiedad

source: Create variables in the Variables panel at the bottom, and use them to edit the widget properties.
es_es: Crea variables en el panel de Variables en la parte inferior y úsalas para editar las propiedades del widget.

source: Created with an older version of UI Designer. Open it for more details.
es_es: Creado con una versión anterior de UI Designer. Ábrela para más detalles.

source: Currency input widget
es_es: Widget de entrada de moneda

source: Current frame (_self)
es_es: Marco actual (_self)

source: Custom URL
es_es: URL personalizada

source: Custom services
es_es: Servicios personalizados

source: Custom style
es_es: Estilo personalizado

source: Custom widget
es_es: Widget personalizado

source: Custom widgets
es_es: Widgets personalizados

source: Custom widgets are not clearly visible on the whiteboard but you can see them with the preview.
es_es: Los widgets personalizados no son claramente visibles en la pizarra pero puedes verlos con la vista previa.

source: Customize the default look and feel as follows:
es_es: Personaliza el aspecto por defecto, como se muestra:

source: DELETE
es_es: ELIMINAR

source: Data
es_es: Datos
