Repository: bonitasoft/bonita-ui-designer-artifact-builder
Catalog: artifact-builder/src/main/resources/i18n/lang-template-*.po
Languages: es_es

source: Data saved on click. You might bind it to the variable you use to initialize your form, e.g. 'formInput'
es_es: Los datos se guardan en clic. Se puede enlazar a la variable que se utiliza para inicializar el formulario, por ejemplo, 'formInput'

source: Data sent on click
es_es: Datos enviados al hacer click

source: Date
es_es: Fecha

source: Date & time display
es_es: Pantalla de fecha y hora

source: Date Placeholder
es_es: Placeholder de la fecha

source: Date and time
es_es: Fecha y hora

source: Date and time can reflect the user time zone (e.g., a meeting day and time) or be absolute, identical everywhere (e.g., opening hours of a store somewhere). This is controlled by the property <em>Handle time zone</em>.
es_es: La fecha y hora puede reflejar la zona horaria del usuario (por ejemplo, el día y la hora de una reunión) o ser absoluta, idéntica en todas partes (por ejemplo, los horarios de apertura de un comercio en algún lugar). Ésto se controla con la propiedad de <em>Gestionar zona horaria</em>.

source: Date display
es_es: Pantalla de la fecha

source: Date filter
es_es: Filtro de fecha

source: Date formats are localized by default. Localized formats can be edited in <em>localization.json</em> (refer to the <a href="javascript:void(0);" ng-click="tabContainer.activeTab = 'localization'">localization section</a>).
es_es: Por defecto, los formatos de fecha están localizados. Los formatos localizados se pueden editar en <em>localization.json</em> (consulte la <a href="javascript:void(0);" ng-click="tabContainer.activeTab = 'localization'"> sección de localización</a> <translate>).</translate>.

source: Date object
es_es: Objetos Date

source: Date objects
es_es: Objetos Date

source: Debounce
es_es: Desmontar

source: Decimal separator
es_es: Separador de decimales

source: Declaration
es_es: Declaración

source: Declare a Bonita resource
es_es: Declarar recurso Bonita

source: Declare the Bonita REST API resources used in this widget.
es_es: Declara los recursos de la API de Bonita REST utilizados en este widget.

source: Default
es_es: Por defecto

source: Default label
es_es: Etiqueta predeterminada

source: Default name
es_es: Nombre por defecto

source: Default value
es_es: Valor predeterminado

source: Default variables
es_es: Variables por defecto

source: Define a condition for widget visibility, <em>userAge &gt; 18</em>
es_es: Define una condición para la visibilidad del widget, <em>userAge > 18</em>

source: Define how to retrieve Business Object
es_es: Definir cómo recuperar el Business Object

source: Define table headers as the value of a variable: <em>myArrayVariable</em>
es_es: Define las cabeceras de la tabla como el valor de una variable: <em>myArrayVariable</em>

source: Defines character(s) separation between currency sign and value
es_es: Define la separación de caracter(es) entre el signo de moneda y el valor

source: Defines endpoint URL where the file will be uploaded
es_es: Define la URL destino donde se subirá el archivo

source: Delete
es_es: Eliminar

source: Delete Bonita resource
es_es: Declarar recurso Bonita

source: Delete asset
es_es: Borra el recurso

source: Delete variable
es_es: Eliminar variable

source: Deletion is not possible
es_es: La eliminación no es posible

source: Describes the property
es_es: Describe la propiedad

source: Describing the content of a data table. To be accessible the description must be relevant (clear and concise).
es_es: Describir el contenido de una tabla de datos. Para ser accesible, la descripción debe ser relevante (clara y concisa).

source: Description
es_es: Descripción

source: Details
es_es: Detalles

source: Determines target application. It is recommended not to hard code it.
es_es: Determina la aplicación de destino. Se recomienda no hardcodearla.

source: Determines the application theme that will be used by the target page. It is recommended not to hard code it.
es_es: Determina el tema de la aplicación que utilizará la página de destino. Se recomienda no hardcodearlo.

source: Direct link to an external file
es_es: Enlace directo a un archivo externo

source: Disabled
es_es: Desactivado

source: Discard changes
es_es: Descartar los cambios

source: Display an image from assets or from a URL
es_es: Mostrar una imagen desde recursos o desde una URL

source: Display name
es_es: Mostrar nombre

source: Display or hide the shortcut button to current day
es_es: Mostrar u ocultar el botón de acceso directo al día actual

source: Display or hide the shortcut button to set date and time to now
es_es: Mostrar u ocultar el botón de acceso directo para ajustar la fecha y hora ahora

source: Display the document in the page or a form
es_es: Muestra el documento en la página o formulario

source: Display type
es_es: Tipo de visualización

source: Displayed key
es_es: Clave mostrada

source: Do not show me this dialog again
es_es: No mostrar este cuadro de diálogo nuevo

source: Do you still want to import this {{ ::importReport.type }} now ?
es_es: ¿Todavía desea importar esta {{ ::importReport.type }} ?

source: Download asset
es_es: Descargar recursos externos

source: Drag and drop a Business Object in the whiteboard or create a new variable of type Business Data.
es_es: Arrastra y suelta un Business Object en el whiteboard o crea una nueva variable de tipo de Business Data.

source: Drag and drop widgets or containers in rows
es_es: Arrastra y suelta widgets o contenedores en las filas

source: Dropdown list of available values. The user selects one value
es_es: Lista desplegable de valores disponibles. El usuario selecciona un valor

source: Dynamic
es_es: Dinámico

source: Dynamic value
es_es: Valor dinámico

source: E.g. Given a variable <em>employee</em> of type External API that fetch the task context <code>../{{context.employee_ref.link}}</code>. To retrive all the addresses of <em>employee</em> that are lazy in the BDM, you can create another variable <em>employee_addresses</em> of type External API with an url parameter like <code>employee | lazyRef : 'addresses'</code>
es_es: Por ejemplo, dada una variable <em>employee</em> de tipo API externa que se obtiene del contexto de la tarea <code>../{{context.employee_ref.link}}</code>. Para recuperar todas las direcciones de <em>employee</em> que son lazy en el BDM, puede crear otra variable <em>employee_addresses</em> de tipo API externa con un parámetro en la url como <code>employee | lazyRef : 'addresses'</code>

source: Each artifact contains a <em>localization.json</em> asset, with keys and translations for all strings and all supported languages (by default french and spanish). Each language has its section and is identified by the ISO 639 language attribute (for example, fr-FR, es-ES). To add new languages, keys and/or translations, export the default <em>localization.json</em>, edit it, and upload it with the same file name. For more information on installing new languages, go to the documentation web site (keywords:
es_es: Cada artefacto contiene un recurso de <em>localization.json</em>, con claves y traducciones de todos los strings y los idiomas soportados (por defecto francés y español). Cada idioma tiene su sección y es identificado por el atributo de idioma ISO 639 (por ejemplo, fr-FR, es-ES). Para agregar nuevos idiomas, claves o traducciones, exporte el <em>localization.json</em> predeterminado, edítelo y súbalo con el mismo nombre del archivo. Para obtener más información sobre la instalación de nuevos idiomas, compruebe el <a href="http://http://documentation.bonitasoft.com" target="_blank"> sitio de documentación de Bonita BPM</a>:

source: Each element of this property has to match an element of the Columns key property to figure out which table column can be sorted upon.
es_es: Cada elemento de esta propiedad tiene que coincidir con un elemento de la propiedad de claves de columnas para definir que columna de la tabla puede ser ordenada.

source: Each type or container has specific behaviors
es_es: Cada tipo de contenedor tiene comportamientos específicos

source: Edit
es_es: Editar

source: Edit Bonita resource
es_es: Editar recurso Bonita

source: Edit asset
es_es: Actualizar recurso

source: Edit property
es_es: Editar propiedad

source: Edit variable
es_es: Editar la variable

source: Edit...
es_es: Editar...

source: Editor organization
es_es: Editor de Organización

source: Either select the widget to switch and click on <i class="fa fa-exchange"></i>.
es_es: Seleccione el widget para cambiar y haga clic en <i class="fa fa-exchange"></i>.

source: Enter ' + vm.mode + ' name
es_es: Introduzca ' + vm.mode + ' nombre

source: Enter a date (mm/dd/yyyy)
es_es: Introduzca una fecha (dd/mm/aaaa)

source: Enter a time (h:mm:ss a)
es_es: Introduzca una hora (h:mm:ss)

source: Error at line <code>{{ infos.location.line }}</code>, column <code>{{ infos.location.column }}</code>
es_es: Error en línea <code>{{ infos.location.line }}</code>, columna <code>{{ infos.location.column }}</code>

source: Error during migration of . Check migration details <i class="fa fa-wrench status"></i> for more details.
es_es: Error durante la migración de . Compruebe los detalles de migración <i class="fa fa-wrench status"></i> para más detalles.

source: Error on upload holder
es_es: Contenido del error de carga

source: Example of a tab title displaying a badge:
es_es: Ejemplo de un título de pestaña que muestra un icono:

source: Example of border table:
es_es: Ejemplo de bordes de tabla:

source: Example: relative time filter
es_es: Ejemplo: filtro de tiempo relativo

source: Expand Preview in new window
es_es: Abrir vista previa en la nueva ventana

source: Expendable text input field with HTML formatting, including style, image, links... This widget is based on textAngular.
es_es: Campo de texto reemplazable con formato HTML, incluyendo estilo, imagen, enlaces... Este widget se basa en textAngular.

source: Explore Data Model in new window
es_es: Explorar Modelo de Datos en una nueva ventana

source: Export
es_es: Exportar

source: Export {{ctrl.page.name}}
es_es: Exportar {{ctrl.page.name}}

source: Exported formats
es_es: Formatos exportados

source: Expose fragment data to page?
es_es: ¿Exponer datos del fragmento en la página?

source: Exposed
es_es: Exponer

source: External
es_es: Externo

source: External API
es_es: API externa

source: External API (variable) or URL
es_es: External API (variable) o URL

source: Extra Small devices (width < 768px)
es_es: Dispositivos extra pequeños (tamaño < 768px)

source: Extra angular modules needed by this custom widget (comma separated)
es_es: Este widget personalizado necesita módulos de angular adicionales (separados por comas)

source: Failed response value
es_es: Valor de la respuesta fallida

source: Favorites
es_es: Favoritos

source: Field where the user can enter information
es_es: Campo donde el usuario puede introducir información

source: Field where the user can enter information with a currency formatting.
es_es: Campo donde el usuario puede introducir información con formato de moneda.

source: File
es_es: Archivo

source: File chooser for uploading a document to a form
es_es: Selector de archivos para subir un documento al formulario

source: File source
es_es: Fuente de archivo

source: File unavailable
es_es: Archivo no disponible

source: FileName
es_es: Nombre de archivo

source: Filter
es_es: Filtro

source: Filters
es_es: Filtros

source: First
es_es: Primero

source: For 'Label' property only. If you choose 'no', HTML code will be escaped instead of being interpreted. If you choose ‘Yes’, this could potentially lead to HTML injections attacks. Please take into account these risks.
es_es: Para la propiedad 'Etiqueta'. Si elige 'no', el código HTML será escapado en lugar de ser interpretado. Si elige "Sí", esto podría provocar ataques de inyecciones HTML. Por favor, tenga en cuenta estos riesgos.

source: For <em>Start process</em> and <em>Submit task</em> actions the format of the data must meet the process/task contract specifications.
es_es: Para las acciones <em>Iniciar proceso</em> y <em>Enviar tarea</em> el formato de los datos debe cumplir las especificaciones del contrato de proceso/tarea.

source: For HTTP requests and Start process / Submit task actions, you can store the response of the request in a variable using the properties:
es_es: Para las acciones Iniciar proceso / Enviar tarea / Peticiones HTTP, se puede almacenar la respuesta de la petición en una variable utilizando las propiedades:

source: For HTTP requests, the following methods are supported:
es_es: Para las Peticiones HTTP, se admiten los siguientes métodos:

source: For Instance to let users save the draft of the current form:
es_es: Por ejemplo para permitir a los usuarios guardar el borrador del formulario actual:

source: For UI Designer artifacts, the Bonita REST API resources are exported in the page.properties files. Those resources are used at deployment to grant permission to those REST API to users having access to this page.
es_es: Para los artefactos de UI Designer, los recursos de Bonita REST API se exportan en los archivos page.properties. Esos recursos se utilizan en el despliegue para conceder permiso a esos API REST a los usuarios que tengan acceso a esta página.

source: For an error response, the message value is 'error' and the property <em>dataFromSuccess</em> is replaced by a property <em>dataFromError</em>
es_es: Para una respuesta de error, el valor del mensaje es 'error' y la propiedad <em>dataFromSuccess</em> se sustituye por una propiedad <em>dataFromError</em>

source: For an example of JavaScript code to handle the message, you can have a look at the asset <em>layout.js</em> in the default application layout (you can retrieve it in the resources section of Bonita Portal Administrator profile).
es_es: Para un ejemplo de código JavaScript para manejar el mensaje, echa un vistazo en el asset <em>layout.js</em> en el layout por defecto de una aplicación (se puede acceder en la sección Recursos usando el perfil del Administrador del Portal de Bonita).

source: For business objects, the UI Designer comes with a <em>lazyRef</em> filter to easily retrieve target url to use in an external API data.
es_es: Para objetos de negocio, el UI Designer viene con un filtro <em>lazyRef</em> para recuperar fácilmente la url objetivo que se utilizará en datos de API externos.

source: For date format specifically, the UI Designer comes with a <em>uiDate</em> filter to easily display dates retrieved from the BDM or any other REST API.
es_es: Para el formato de fecha en concreto, el UI Designer provee un filtro <em>uiDate</em> para mostrar fácilmente las fechas obtenidas de la BDM o cualquier otra API REST.

source: For example #FF0000, #0066FF
es_es: Por ejemplo #FF0000, #0066FF

source: For instance, with a custom link widget :
es_es: Por ejemplo, con un widget de enlace personalizado:

source: For more information, consult the <a href="https://documentation.bonitasoft.com/?page=live-update#cache_busting">documentation</a>.
es_es: Para obtener más información, consulte la <a href="https://documentation.bonitasoft.com/?page=live-update#cache_busting"> documentación</a>.

source: For more information, refer to the <a href="javascript:void(0);" open-help="localization" editor-mode="page"><em>localization</em> help section</a>.
es_es: Para obtener más información, consulte la <a href="javascript:void(0);" open-help="localization" editor-mode="page"> sección de ayuda de la <em>localización</em></a>.

source: For more information, see the AngularJS guide on <a href="https://docs.angularjs.org/guide/templates">templates</a> and <a href="https://docs.angularjs.org/guide/controller">controllers</a>.
es_es: Para obtener más información, consulte a la guía de AngularJS de <a href="https://docs.angularjs.org/guide/templates"> plantillas</a> y <a href="https://docs.angularjs.org/guide/controller"> Controladores</a>.

source: For new artifacts, you need to add the asset yourself in the custom widgets or pages that require it.
es_es: Para los nuevos artefactos, necesitará agregar el fichero en los widgets personalizados o páginas que lo requieran.

source: For the moment, you cannot implement custom widget containers.
es_es: Por el momento, no se puede implementar un widget contenedor personalizado.

source: Format
es_es: Formato

source: Format used to display the date
es_es: Formato utilizado para mostrar la fecha

source: Format used to display the time
es_es: Formato utilizado para mostrar la hora

source: Formatting toolbar
es_es: Barra de herramientas de formato

source: Forms
es_es: Formularios

source: Four device types are available:
es_es: Existen cuatro tipos de dispositivo:

source: Fragment
es_es: Fragmento

source: Fragment data '' + name + '' will be bound to page data '' + binding + '', and thus not have it default value '' + data.value + ''
es_es: La variable de fragmento '' + name+ '' será linkada a la variable de la página '' + binding+ '', por lo tanto, no mantendrá su valor predeterminado '' + data.value + ''

source: Fragment data '' + name + '' will keep its default value '' + data.value + ''
es_es: La variable de fragmento '' + name+ '' mantendrá su valor predeterminado '' + data.value + ''

source: Fragment name
es_es: Nombre del fragmento

source: Fragments
es_es: Fragmentos

source: Frontend has been migrated to AngularJS 1.8. Note: artefacts are still generated with AngularJS 1.3. Stay tuned for further updates.
es_es: Frontend ha sido migrado a AngularJS 1.8. Nota: los artefactos todavía son generados con AngularJS 1.3. Mantente atento para más actualizaciones.

source: Functions exposed in the controller can be used with ctrl.newFunction().
es_es: Las funciones expuestas en el controlador pueden utilizarse con ctrl.newFunction().

source: Get a case by its identifier
es_es: Obten un caso por su identificador

source: Get a human task by its identifier
es_es: Obtén una tarea humana por su identificador

source: Get all business variables defined in a case
es_es: Obtener todas las variables del negocio definidas en un caso

source: Get all the advanced features such as fragments and localization in the community edition.
es_es: Obtén todas las características avanzadas como fragmentos y localización en la edición comunitaria.

source: Get current logged user
es_es: Obtén el actual usuario logueado

source: Get custom information of a user
es_es: Obtener información personalizada de un usuario

source: Get professional details of a user
es_es: Obtén los detalles profesionales de un usuario

source: Go full screen
es_es: Ir a pantalla completa

source: Graphical display of numerical data to ease understanding. This widget is based on angular-chart-0.8.1, which is based on Chart.js. For information see http://jtblin.github.io/angular-chart.js/ and http://www.chartjs.org/docs/. Available chart types to display a single set of data are pie, doughnut, and polar area. For multiple sets of data, available chart types are bar, line, and radar.
es_es: Representación gráfica de datos numéricos para facilitar la comprensión. Este widget se basa en angular-chart-0.8.1, que, a su vez, se basa en Chart.js. Para obtener información, vea http://jtblin.github.io/angular-chart.js/ y http://www.chartjs.org/docs/. Los tipos de gráfico disponibles para mostrar un único conjunto de datos son "Pie", "Doughnut" y "Polar area". Para varios conjuntos de datos, los tipos de gráfico disponibles son "Bar", "Line" y "Radar".

source: Group of widgets used to define the arrangement of the page elements. Its content can be repeated over an array
es_es: Grupo de widgets utilizados para definir la disposición de los elementos de página. Su contenido puede ser repetido sobre un array

source: Group of widgets used to define the arrangement of the page elements. Its content is display like in modal.
es_es: Grupo de widgets utilizados para definir la disposición de los elementos de la página. Su contenido se muestra como en modal.

source: Group of widgets, inside a Tabs container
es_es: Grupo de widgets, dentro de un Tabs container

source: HTTP method
es_es: Método HTTP

source: HTTP request
es_es: Petición HTTP

source: HTTP status code
es_es: Código de estado HTTP

source: Handle time zone
es_es: Gestionar la zona horaria

source: Headers
es_es: Cabeceras

source: Help
es_es: Ayuda

source: Help data model
es_es: Ayuda Data Model

source: Here is the format of the message posted to the parent frame in JSON (in the parent frame you will need to call <code>JSON.parse</code> as it is stringified before being sent):
es_es: Aquí está el formato del mensaje publicado en el frame principal en JSON (en el parent frame necesitarás llamar a <code>JSON.parse</code> ya que está "stringificado" antes de ser enviado):

source: Hidden
es_es: Oculto

source: Holds the HTTP status code of the response
es_es: Contiene el código de estado HTTP de la respuesta

source: Holds the response content from the upload error endpoint. That value can be used to guidance purpose
es_es: Contiene el contenido de la respuesta de error desde el punto final del error de carga. Ese valor puede utilizarse para guiar al usuario

source: Holds the response from the upload endpoint. That value can be used to fulfill a contract
es_es: Guarda la respuesta obtenida del endpoint de carga de fichero . Ese valor puede utilizarse para cumplir con un contrato de

source: Holds the response when the request has failed
es_es: Es la respuesta cuando la llamada falla

source: Holds the response when the request is successful
es_es: Es la respuesta cuando la llamada se realiza correctamente

source: Home page
es_es: Página de inicio

source: How to customize Zebra-striping
es_es: Como personalizar las filas alternas

source: How to customize border
es_es: Como personalizar el borde

source: However, <b>the output of the widget is always a Javascript Date object</b>. So it will change the type of the variable bound to the widget <em>Value</em> to a Date object when the user selects a date. This is required in order to ensure backward compatibility for pages designed with older UI Designer versions.
es_es: Sin embargo, <b>la salida del widget siempre es un objeto Javascript Date</b>. Así que va a cambiar el tipo de la variable atada al <em>Valor</em> del widget a un objeto Date cuando el usuario selecciona una fecha. Esto es necesario para asegurar la compatibilidad con versiones anteriores de páginas diseñadas con versiones antiguas del UI Designer.

source: However, such a redirection of the current window (frame) won't be performed in Bonita portal nor in an application iframe with id <em>bonitaframe</em> (as in the default application layout). This is due to the fact that Bonita Portal and the default application layout handle the successful response by themselves.
es_es: Sin embargo, tal redirección de la ventana actual (frame) no se realizará en el portal de Bonita ni en un iframe de una aplicación con id <em>bonitaframe</em> (como en el layout de las aplicaciones por defecto). Esto es debido a que el Bonita Portal y el layout por defecto de las aplicaciones manejan la respuesta exitosa por sí mismos.

source: Html template update
es_es: Actualización de plantilla Html

source: Human task form
es_es: Formulario de tarea humana

source: Id must be unique, so the {{ ::importReport.overwrittenType }} <strong>{{ ::importReport.overwrittenName }}</strong> will be overwritten.
es_es: El Id debe ser único, por lo que se sobrescribirá <strong>{{ ::importReport.overwrittenName }}</strong> de tipo {{ ::importReport.overwrittenType }}.

source: Id must be unique, so those elements will be overwritten.
es_es: El Id debe ser único, por lo que se sobrescribirán esos elementos.
