Repository: bonitasoft/bonita-ui-designer-artifact-builder
Catalog: artifact-builder/src/main/resources/i18n/lang-template-*.po
Languages: es_es

source: No. This data will be specific to this fragment.
es_es: No. Estos datos serán específicos a este fragmento.

source: No: user time zone is ignored. <br>Yes: display/input reflects the user time zone and may be different from value
es_es: No: la zona horaria del usuario no es tenida en cuenta. <br>Sí: la pantalla/entrada refleja la zona horaria del usuario y puede ser diferente del valor

source: None
es_es: Ninguno

source: Not compatible with current UI Designer version. To open it, use a newer version of UI Designer.
es_es: No es compatible con la versión actual de UI Designer. Para abrirla, utilice una versión más reciente de UI Designer.

source: Note that reordering assets is disabled when the list is a search results list. Indeed, reordering is only relevant if the complete list of page assets is displayed.
es_es: Tenga en cuenta que reordenar los assets está desactivado cuando la lista es una lista de resultados de búsqueda. De hecho, reordenar sólo es relevante si se muestra la lista completa de los assets de la página.

source: Noteworthy changes
es_es: Cambios notables

source: Now
es_es: Ahora

source: Now button label
es_es: Etiqueta del botón Ahora

source: Number of array elements defines the number of times the container structure is repeated. Array data is available to widgets in the container
es_es: El número de elementos del array define el número de veces que se repite la estructura del contenedor. Un array de datos está disponible para los widgets en el contenedor

source: Number of decimal
es_es: Número de decimales

source: Number of digits after the decimal separator
es_es: Número de dígitos después del separador decimal

source: Numerical value entered by user input formatted as float number. A rounding is applied.
es_es: Valor numérico introducido por la entrada del usuario formateado como número flotante. Se aplica un redondeo.

source: Object key to display
es_es: Clave de objeto para mostrar

source: Object key to display. Leave it empty for whole object
es_es: Clave del objeto a mostrar. Dejarlo vacío para el objeto entero

source: Once you select an element, edit its properties in the properties panel on the right.
es_es: Una vez seleccionado un elemento, edita sus propiedades en el panel de propiedades de la derecha.

source: Only works with formats supported by the browser (by default PDF and image)
es_es: Sólo funciona con formatos soportados por el navegador (por defecto PDF e imagen)

source: Open Modal
es_es: Abrir Modal

source: Open documentation
es_es: Abrir documentación

source: Open help
es_es: Abrir ayuda

source: Open modal
es_es: Abrir modal

source: Or use the <b>Switch</b> menu option close to the widget name in the properties panel.
es_es: O utilice la opción de menú <b>Cambiar</b> cerca del nombre del widget en el panel de propiedades.

source: Ordered by artifact name.<br/>Click to sort by last update
es_es: Ordenado por nombre de artefacto. <br/> Haz clic en ordenar por última actualización

source: Ordered by last update.<br/>Click to sort by artifact name
es_es: Ordenado por última actualización. <br/> Haz clic para ordenar por nombre del artefacto

source: Overridden artifacts
es_es: Artefactos reemplazados

source: Overview
es_es: Vista global

source: Page Name
es_es: Nombre de la página

source: Page description
es_es: Descripción de la página

source: Page display name
es_es: Nombre para mostrar de la página

source: Page level
es_es: Nivel de página

source: Page size
es_es: Tamaño de página

source: Page token
es_es: Token de la página

source: Pages
es_es: Páginas

source: Parent frame (_parent)
es_es: Frame padre (_parent)

source: Perform an HTTP request
es_es: Llevar a cabo una petición HTTP

source: Permissions to access Bonita platform’s REST API resources are handled by a configurable authorization mechanism, check Bonita documentation for more details.
es_es: Los permisos para acceder a los recursos de la API REST de la plataforma Bonita son manejados por un mecanismo de autorización configurable, compruebe la documentación de Bonita para más detalles.

source: Please provide the information on how to retrieve elements of "{{ctrl.businessData.name}}"
es_es: Por favor, proporcione la información sobre cómo recuperar elementos de "{{ctrl.businessData.name}}"

source: Preview
es_es: Vista Previa

source: Preview - {{pageName}}
es_es: Vista previa - {{pageName}}

source: Preview of
es_es: Vista previa de

source: Process document
es_es: Documento de proceso

source: Process form
es_es: Formulario de proceso

source: Process instantiation form
es_es: Formulario de instanciación de proceso

source: Process name
es_es: Nombre de Proceso

source: Process version
es_es: Versión de proceso

source: Properties
es_es: Propiedades

source: Property names must start with a letter and contain only alphanumeric characters
es_es: Los nombres de página deben empezar con una letra y contener sólo caracteres alfanuméricos

source: Put usage of this widget. This information is only visible on UI-Designer editor
es_es: Esta información sólo es visible en el editor de UI-Designer

source: Read-only
es_es: Sólo lectura

source: Read-write binding, initialized or updated by users' input (bi-directional bond)
es_es: Enlace de lectura-escritura, inicializado o actualizado por la entrada de los usuarios (enlace bidireccional)

source: Referenced in a case context (current case or other cases)
es_es: Referenciado en un contexto de caso (caso actual u otros casos)

source: Relative time filter
es_es: Filtro de tiempo relativo

source: Remove
es_es: Eliminar

source: Remove from collection
es_es: Eliminar de la colección

source: Remove tab
es_es: Eliminar Pestaña

source: Rename
es_es: Renombrar

source: Repeat container content. Variable of type array
es_es: Repetir el contenido del contenedor. Variable de tipo array

source: Repeat content for the plain container
es_es: Repetir el contenido en el contenedor

source: Repeated container
es_es: Contenedor repetido

source: Request
es_es: Petición

source: Required
es_es: Requerido

source: Required angular modules
es_es: Módulos angular requeridos

source: Reset mapping
es_es: Restablecer mapeo

source: Reset mapping to default
es_es: Restablecer mapeo por defecto

source: Response
es_es: Respuesta

source: Response headers
es_es: Cabeceras de la respuesta

source: Response status code
es_es: Código de estado de respuesta

source: Returned key
es_es: Clave de retorno

source: Row
es_es: Fila

source: Rows
es_es: Filas

source: Save
es_es: Guardar

source: Save a variable to the LocalStorage
es_es: Guardar una variable en el LocalStorage

source: Save as ...
es_es: Guardar como ...

source: Save as fragment...
es_es: Guardar como fragmento...

source: Save as...
es_es: Guardar como...

source: Save data to / Load data from LocalStorage.
es_es: Guardar los datos / Cargar los datos desde el LocalStorage.

source: Save draft
es_es: Guardar borrador

source: Save {{ctrl.page.name}} as...
es_es: Guardar {{ctrl.page.name}} como...

source: Save {{ctrl.widget.name}} as...
es_es: Guardar {{ctrl.widget.name}} como...

source: Saved
es_es: Guardado

source: Search
es_es: Búsqueda

source: Search a list of cases based on search indexes
es_es: Busca una lista de casos basándose en índices de búsqueda

source: Search on name
es_es: Buscar por nombre

source: See <a href="https://github.com/chartjs/Chart.js/tree/v1.0.2/docs" target="_blank">chart.js</a> for details of the chart options for each type of chart. Specify a JSON structure corresponding to the options you want
es_es: Ver <a href="https://github.com/chartjs/Chart.js/tree/v1.0.2/docs" target="_blank">chart.js</a> para más detalles de las opciones de cada tipo de gráfico. Especifica una estructura JSON correspondiente a las opciones que desees

source: See example
es_es: Ver ejemplo

source: See example 'date object initialization'
es_es: Ver ejemplo de 'inicialización objeto fecha'

source: See example 'functional programming'
es_es: Ver ejemplo de 'programación funcional'

source: See examples
es_es: Ver ejemplos

source: See the default localization asset for an example.
es_es: Ver el recurso localización por defecto para obtener un ejemplo.

source: Select
es_es: seleccionar

source: Select a widget or start typing
es_es: Seleccione un widget o comience a escribir

source: Select an element on the whiteboard, then set its properties here
es_es: Selecciona un elemento en la pizarra, a continuación, establece allí sus propiedades

source: Select an option
es_es: Seleccione una opción

source: Select the device type icon in the top bar, then specify the width property for each widget in the page or form. Each configuration is independent. To specify the width property for a widget for all device types, set the value for each device type separately, or leave the default value.
es_es: Seleccione el icono de tipo de dispositivo en la barra superior, luego especifique la propiedad width para cada widget de la página o formulario. Cada configuración es independiente. Para especificar la propiedad width de un widget para todo tipo de dispositivo, establezca el valor para cada tipo de dispositivo por separado, o deje el valor por defecto.

source: Select the query to retrieve Business Object. Queries can be a simple attribute query (ex: findByName) or an additional query such as a custom query.
es_es: Seleccione la consulta para recuperar el Objeto de Negocio. Las consultas pueden ser una consulta de atributos simple (ej: findByName) o una consulta adicional como una consulta personalizada.

source: Select your .zip file
es_es: Seleccione su archivo .zip

source: Select your file
es_es: Selecciona tu archivo

source: Select your localization.json
es_es: Selecciona el localization.json

source: Selected
es_es: Seleccionada

source: Selected Row
es_es: Fila seleccionada

source: Selected Value
es_es: Valor seleccionado

source: Selected values
es_es: Valores seleccionados

source: Send data to this URL when the button is clicked
es_es: Enviar datos a esta dirección URL cuando se hace clic en el botón

source: Set <code>Bordered</code> property at true.
es_es: Establece las propiedades <code>Bordered</code> como activadas.

source: Set labels
es_es: Definir etiquetas

source: Set of buttons for mutually exclusive options. The user selects one option
es_es: Conjunto de botones (radio) de opciones mutuamente excluyentes. El usuario selecciona una opción

source: Set of checkboxes for options. The user selects zero or more
es_es: Conjunto de casillas de verificación para las opciones. El usuario selecciona cero o más

source: Set the Data source to Bonita API to populate the data table with records from a Bonita REST API.
es_es: Configurar la fuente de datos como Bonita API para poblar la tabla de datos con datos obtenidos del REST API Bonita.

source: Set the input time on the same line as the input date
es_es: Introduzca la hora y la fecha en la misma línea

source: Short hint that describes the expected input format for the date
es_es: Ayuda breve que describe el formato esperado para la introducción de la fecha

source: Short hint that describes the expected input format for the time
es_es: Ayuda breve que describe el formato esperado para la introducción de la hora

source: Short hint that describes the expected value
es_es: Ayuda breve que describe el valor esperado

source: Short string or paragraph of text to be displayed. Can include HTML tags
es_es: Cadena corta o párrafo de texto que se mostrará. Pueden incluir etiquetas HTML

source: Should contain time zone information only when 'Handle time zone' is set to 'yes'
es_es: Debe contener información de zona horaria sólo cuando 'Gestionar zona horaria' es marcada "sí"

source: Show Now button
es_es: Mostrar botón Ahora

source: Show Today button
es_es: Mostrar botón Hoy

source: Show preview
es_es: Mostrar vista previa

source: Show properties
es_es: Mostrar propiedades

source: Shows the languages for which there are translations in localization.json and Default, which is the source language of your page
es_es: Muestra los idiomas para los cuales existen traducciones en localization.json y Default, que es la lengua de la fuente de su página

source: Since 7.12.0, after an artifact has been migrated, a migration report <i class="fa fa-wrench status"></i> is available from the editor header. It disappears once the page is refreshed, but can be retrieved in the UI Designer log file.
es_es: Desde la 7.12.0, después de la migración de un artefacto, un informe de migración <i class="fa fa-wrench status"></i> está disponible en el encabezado del editor. Desaparece una vez que la página se actualiza, pero se puede recuperar en el archivo de log de UI Designer.

source: Since 7.5.0, UI Bootstrap is no longer provided in the UI Designer pages.
es_es: Desde 7.5.0, UI Bootstrap ya no es proporcionado en el UI Designer.

source: Single set charts
es_es: Gráficas de conjunto simple

source: Size
es_es: Tamaño

source: Small devices (width ≥ 768px)
es_es: Pequeños dispositivos (tamaño ≥ 768px)

source: Some improvements for <b>Accessibility</b> will help you design and generate digitally accessible pages, forms or applications (for example: computer screen readers).
es_es: Algunas mejoras para <b>Accesibilidad</b> le ayudarán a diseñar y generar páginas, formularios o aplicaciones de acceso digital (por ejemplo: lectores de pantalla de computadora).

source: Some option can be disabled because the source value type is not compatible with target property type.
es_es: Alguna opción puede desactivarse porque el tipo de valor de origen no es compatible con el tipo de propiedad de destino.

source: Sort
es_es: Ordenar

source: Sortable columns
es_es: Columnas ordenables

source: Source
es_es: Origen

source: Source Type
es_es: Tipo Fuente

source: Space-separated list
es_es: Lista separada por espacios

source: Specifies an alternate text for an image. The text should describe the image if the image contains information or should be left empty if the image is only for decoration
es_es: Especifica un texto alternativo para una imagen. El texto debe describir la imagen si la imagen contiene información o se debe dejar vacía si la imagen es sólo para decoración

source: Specifies the case (process instance) Id
es_es: Especifica el Id del caso (la instancia del proceso)

source: Specifies the legal number intervals between values
es_es: Especifica los intervalos de número legales entre los valores

source: Specifies the process name
es_es: Especifica el nombre del proceso

source: Specifies the process version
es_es: Especifica la versión del proceso

source: Specifies the task instance Id
es_es: Especifica el Id de la instancia de tarea

source: Specifies the type of link to create
es_es: Especifica el tipo de enlace a crear

source: Specifies where to open the linked document
es_es: Especifica dónde abrir el documento vinculado

source: Specify the number of columns of the element. All elements can take up to 12 columns.
es_es: Especifique el número de columnas del elemento. Todos los elementos no podrán sobrepasar 12 columnas.

source: Standard widgets JavaScript for edition outside the UI Designer
es_es: Widgets estándar JavaScript para edición fuera del UI Designer

source: Start a process
es_es: Iniciar un proceso

source: Start creating a <b>process form</b> in Bonita Studio: from the appropriate pool or human task, create a contract and launch the UI Designer. It will auto-generate a dedicated form to edit.
es_es: Comienza creando un <b>formulario de proceso</b> en Bonita Studio: desde la Pool apropiada o desde una tarea humana, crea un contrato y ejecuta el UI Designer. Auto-generará un formulario correspondiente que se podrá editar.

source: Start creating an <b>application layout</b> by importing the default layout, available in the Bonita Portal resources, and edit it.
es_es: Comience creando un <b>layout de la aplicación</b> mediante la importación del layout por defecto, en los recursos de Bonita Portal y edítelo.

source: Start process
es_es: Iniciar proceso

source: Static
es_es: Estático

source: Step
es_es: Tarea

source: Store as Number value
es_es: Guardar como valor numérico

source: Store as a Json object { header-name : HeaderValue } and can be accessed using this syntax $data.myRequestHeaders['header-name']
es_es: Almacenar como un objeto Json { header-name : HeaderValue } y se puede acceder usando esta sintaxis $data.myRequestHeaders['header-name']

source: String
es_es: Cadena (String)

source: Style
es_es: Estilo

source: Style toolbar
es_es: Barra de herramientas de estilo

source: Styling zebra-striping can be done in the theme.css file to customize <b>all</b> the tables.
es_es: El estilo de colores alternos en las tablas, puede ser realizado en el fichero "theme.css", para personalizar <b>todas</b> las tablas.

source: Styling zebra-striping can be done in the theme.css file to customize all data-tables.
es_es: El estilo de colores alternos en las tablas, puede ser realizado en el fichero "theme.css", para personalizar todas las tablas.

source: Subgroup of toolbar buttons for extra options
es_es: Subgrupo de botones de la barra de herramientas para opciones extra

source: Subgroup of toolbar buttons to arrange the text layout
es_es: Subgrupo de botones de la barra de herramientas para arreglar la disposición del texto

source: Subgroup of toolbar buttons to set how the text looks
es_es: Subgrupo de botones de la barra de herramientas para establecer cómo se muestra el texto

source: Subgroup of toolbar buttons to structure the text
es_es: Subgrupo de botones de la barra de herramientas para estructurar el texto

source: Submit
es_es: Enviar

source: Submit a task
es_es: Enviar una tarea

source: Submit task
es_es: Enviar tarea

source: Successful import
es_es: Importación exitosa

source: Successful response value
es_es: Valor de la respuesta exitosa

source: Summary of the Bonita REST API calls made by the page.
es_es: Resumen de las llamadas a la API REST de Bonita realizadas por la página.

source: Switch
es_es: Cambiar

source: Switch <i class="fa fa-exchange"></i>
es_es: Cambiar <i class="fa fa-exchange"></i>

source: Switch to
es_es: Cambiar a

source: Switch {{ctrl.propertiesFrom.name}} {{ctrl.widgetFrom.$$widget.type}}
es_es: Cambiar {{ctrl.propertiesFrom.name}} {{ctrl.widgetFrom.$$widget.type}}

source: Switch...
es_es: Cambiar...

source: Symbol
es_es: Símbolo

source: Symbol indentation
es_es: sangría de símbolos

source: Symbol position
es_es: Posición de Símbolo

source: Tab properties usage
es_es: Uso de propiedades de la pestaña

source: Tab widget: Possibility to define the selected tab
es_es: Widget de pestañas: Posibilidad de definir la pestaña seleccionada

source: Table
es_es: Tabla

source: Table and Data table widget have a new <code>caption</code> property available for adding a title
es_es: El widget de tabla y tabla de datos tienen una nueva propiedad <code>caption</code> disponible para agregar un título

source: Table with pagination and filtering capabilities
es_es: Tabla con capacidad de filtrado y paginación

source: Tabs container
es_es: Contenedor de pestañas

source: Tabular presentation of data from an array
es_es: Presentación en formato tabla de una matriz de datos

source: Target
es_es: Destino

source: Target URL on success
es_es: Dirección URL de destino en éxito

source: Task Id
es_es: Id de tarea

source: Technical Format
es_es: Formato técnico

source: Technical date format
es_es: Formato de fecha técnica

source: Technical time format
es_es: Formato de hora técnica

source: Template
es_es: Plantilla

source: Text
es_es: Texto

source: Text used to structure the page or form content
es_es: Texto utilizado para estructurar el contenido de la página o formulario

source: Text, optionally including variables in simple expressions for interpolation using [[ variableName ]]
es_es: Texto, incluyendo opcionalmente variables en expresiones simples para la interpolación usando [[ variableName ]]

source: The .zip archive of an exported page contains:
es_es: El archivo .zip de una página exportada contiene:

source: The <code>Sortable columns</code> property enables to list the columns which allow a sorted search.
es_es: La propiedad <code>Sortable columns</code> permite enlistar las columnas que permiten una busqueda ordenada.

source: The <em>Close modal</em> action will close the modal container that contains the button when it is pressed.
es_es: La acción <em>Cerrar modal</em> cerrará la modal que contiene el botón cuando se presione.

source: The <em>Open modal</em> action can be used to open any modal container on the page. To point towards the right one, specify the ID in the button's "Modal ID" property.
es_es: La acción <em>Abrir modal</em> puede usarse para abrir cualquier contenedor modal de la página. Para especificar cual, defina el ID de la modal en la propiedad "Modal Id".

source: The <em>Technical date format</em> and <em>Technical time format</em> properties define the format of the values displayed in the date and time inputs. They should be valid <a href="https://code.angularjs.org/1.3.18/docs/api/ng/filter/date" target="_blank">AngularJS date/time formats</a>.
es_es: Las propiedades de <em>Formato técnico de fecha</em> y <em>Formato técnico de tiempo</em> definen el formato de los valores que se muestran en las entradas de fecha y hora. Deben ser <a href="https://code.angularjs.org/1.3.18/docs/api/ng/filter/date" target="_blank">formatos AngularJS de fecha/hora</a> válidos.

source: The <em>Technical date format</em> property define the format of the values displayed in the date input. It should be a valid <a href="https://code.angularjs.org/1.3.18/docs/api/ng/filter/date" target="_blank">AngularJS date format</a>.
es_es: La propiedad de <em>Formato técnico de fecha</em> define el formato de los valores que se muestran en las entradas de fecha. Debe ser un <a href="https://code.angularjs.org/1.3.18/docs/api/ng/filter/date" target="_blank">formato AngularJS de fecha</a> válido.

source: The <em>data sent on click</em> for POST and PUT requests must be a JavaScript Object (JSON can be used). This data will be sent in the body of the request.
es_es: Los <em>Datos enviados al hacer click</em> para las peticiones POST y PUT debeN ser un objeto JavaScript (JSON puede ser utilizado). Esta información se enviará en el cuerpo de la solicitud.

source: The Display Type property allows you to customize the tabs style ('tabs' or 'pills').
es_es: La propiedad Display Type le permite personalizar el estilo de las pestañas ('pestañas' o 'pastillas').

source: The UI Designer generates <b>standard html application code, based on AngularJS</b>. Export pages if you want to further customize them in a different favorite web development environment.
es_es: El UI Designer genera <b>el código de la aplicación del estándar html, basado en AngularJS</b>. Exporta páginas si quieres personalizarlas aún más en tu entorno de desarrollo web favorito.

source: The UI Designer is displayed in the language of your Bonita Studio.
es_es: El UI Desginer se muestra en el idioma de tu Bonita Studio.

source: The automatic detection allows you to see explicitly which REST API resources is needed in your artifact from the newest Bonita Resource panel.
es_es: La detección automática le permite ver explícitamente qué recursos de la API REST son necesarios en su artefacto desde el panel de Recursos de Bonita más reciente.

source: The caption will be displayed as such below the property label.
es_es: El título se mostrará como tal debajo de la etiqueta de propiedad.
