Repository: bonitasoft/bonita-ui-designer-artifact-builder
Catalog: artifact-builder/src/main/resources/i18n/lang-template-*.po
Languages: es_es

source: To save <strong>{{ ::importReport.overwrittenName }}</strong> with a different identifier, open it and use <i>Save as</i> before you import.
es_es: Para guardar <strong>{{ ::importReport.overwrittenName }}</strong> con un identificador diferente, ábralo e use <i>Guardar como</i> antes de importarlo.

source: To select a date and a time (e.g., to schedule a meeting), use the <em>Date time picker</em> widget instead.
es_es: Para seleccionar una fecha y una hora (por ejemplo, para planear una cita), utilice el widget de <em>Selector de hora y fecha</em> en su lugar.

source: To select only a date (e.g., a date of birth), use the <em>Date picker</em> widget instead.
es_es: Para seleccionar sólo una fecha (por ejemplo, fecha de nacimiento), utilice el widget de <em>Selector de fecha</em>.

source: To support multi-languages for end-users, it includes a mechanism to translate the UI artifacts (pages, forms, layouts) created.
es_es: Para dar soporte con múltiples idiomas para los usuarios finales, se incluye un mecanismo para traducir los artefactos del UI Designer creados (páginas, formularios, layouts).

source: To switch widget, use another browser: Google Chrome or Mozilla Firefox.
es_es: Para cambiar el widget, utilice otro navegador: Google Chrome o Mozilla Firefox.

source: To use AngularJS standard services, you must declare them in the main function arguments.
es_es: Para utilizar los servicios estándar de AngularJS, debe declararlos en los argumentos de la función principal.

source: To use a localization asset, replace the default localization.json file with a file of the same format containing all the keys in the page and the translations into the target languages. The localization asset is at page level. The format of the file must be:
es_es: Para utilizar un recurso de localización, reemplace el archivo de localization.json predeterminado con un archivo con el mismo formato que contenga todas las claves de la página y las traducciones en los idiomas de destino. La localización es a nivel de página. El formato del archivo debe ser:

source: To use an image asset in the image widget, set the <code>Source type</code> property to <i>Asset</i>, and then enter the image name in the <code>Asset name</code> input field.
es_es: Para usar un recurso de imagen en el widget de imagen, establece la propiedad <code>Tipo Fuente</code> como <i>Recurso</i> y luego introduce el nombre de la imagen en el campo de entrada <code>nombre del recurso</code>.

source: To use the collection data in the widgets of this container, there are contextual variables that you can bind to the widget properties:
es_es: Para utilizar una colección de datos en los widgets de este contenedor, hay variables contextuales que se pueden enlazar a las propiedades del widget:

source: To use the same asset in several pages, you can add it to a custom widget and use this custom widget in your application pages or forms. When you add a custom widget with assets to a page, those assets are automatically linked to the page.
es_es: Para utilizar el mismo recurso en varias páginas, puede agregar un widget personalizado y utilizar este widget personalizado en sus páginas o formularios de la aplicación. Cuando se agrega un widget personalizado con los recursos a una página, esos recursos se vinculan automáticamente a la página.

source: To view the code of a standard widget, use the <b>View</b> menu option close to the widget name in the properties panel. From there, to use the standard widget as a basis for a custom widget, click on <b>Save as</b>, find a name for the custom widget, and make it your own.
es_es: Para ver el código de un widget estándar, utilice la opción del menú <b>Ver</b> cerca del nombre del widget en el panel de propiedades. Desde ahí, para usar el widget estándar como base para un widget personalizado, haga clic en <b>Guardar como</b>, defina un nombre para el widget personalizado, y ya dispondrá de su widget custom.

source: Today
es_es: Hoy

source: Today & Now
es_es: Hoy y ahora

source: Today button label
es_es: Etiqueta del botón Hoy

source: Toggle properties panel
es_es: Toggle Panel de propiedades

source: Top frame (_top)
es_es: Frame superior (_top)

source: Translate the given text
es_es: Traducir este texto

source: Treat as
es_es: Tratar como

source: Treat value as
es_es: Tratar el valor como

source: Trigger for an action in a page or form
es_es: Desencadenante de una acción en una página o formulario

source: Two use cases : <ul> <li><code>dateVariable|uiDate</code> applies a default <a href="https://code.angularjs.org/1.3.18/docs/api/ng/filter/date" target="_blank">format</a>. For an ISO 8601 string with a time, the default format is <em>'medium'</em>. Otherwise, it is <em>'mediumDate'</em>.</li> <li><code>dateVariable|uiDate:format</code> if you need to be more specific in which format, it can be specified exactly the same way as with <a href="https://code.angularjs.org/1.3.18/docs/api/ng/filter/date" target="_blank">angularJS date filter</a>.<br> E.g. <code>dateVariable|uiDate:'short'</code> or <code> dateVariable|uiDate:'dd/MM/yyyy'</code></li> </ul>
es_es: Dos casos de uso: <ul><li><code>dateVariable | uiDate</code> se aplica un <a href="https://code.angularjs.org/1.3.18/docs/api/ng/filter/date" target="_blank"> formato</a> por defecto. Para una cadena ISO 8601 con una hora, el formato por defecto es <em>'medium'</em>. De lo contrario, es <em>'mediumDate'</em>.</li> <li><code>dateVariable | uiDate:format</code> si necesita ser más específico en el formato, puede especificarlo exactamente de la misma manera que con <a href="https://code.angularjs.org/1.3.18/docs/api/ng/filter/date" target="_blank">filtro de fecha de angularJS</a>. <br>Ej <code>dateVariable | uiDate: 'short'</code> o <code>dateVariable | uiDate: ' dd/MM/AAAA'</code></li></ul>

source: Type
es_es: Tipo

source: UI Designer <span ng-if="isExperimentalMode()">(Experimental)</span>
es_es: Diseñador de interfaz de usuario <span ng-if="isExperimentalMode()">(Experimental)</span>

source: URL parameter
es_es: Parámetro de URL

source: URL parameter name
es_es: Nombre del parámetro de URL

source: URL parameters
es_es: Parámetros de URL

source: URL to call
es_es: URL a llamar

source: URL used to perform the HTTP request when this button is clicked.
es_es: Dirección URL utilizada para realizar la solicitud HTTP cuando se hace clic en este botón.

source: Unable to access Business Data Model. Restart Bonita Studio and try again.
es_es: Incapaz de acceder al Business Data Model. Reinicie Bonita Studio e intentelo de nuevo.

source: Unable to connect to the Business Data Model. Restarting the Studio may solve this issue
es_es: Imposible de conectarse al Modelo de Datos de Negocio. Intente reiniciar el Studio para resolver el error

source: Unique ID of this modal
es_es: ID única de este modal

source: Unique checkbox for an option. The user checks it or not
es_es: Casilla de verificación única. El usuario la marca o no

source: Unmark as favorite
es_es: Desmarcar como Favorito

source: Update asset
es_es: Editar recurso

source: Upgrade between maintenance versions without migration. When a migration is required, get help from the UI Designer (warning icon, confirmation dialog, migration report)
es_es: Actualizar entre versiones de mantenimiento sin migración. Cuando se requiera una migración, obtener ayuda del UI Designer (icono de advertencia, diálogo de confirmación, informe de migración)

source: Upgrade to a newer UI Designer version to import this {{type}}
es_es: Actualizar a una nueva versión del UI Designer para importar este {{type}}

source: Usage
es_es: Uso

source: Use $collection to act on the collection of a repeated content
es_es: Use $collection para actuar en la colección de un contenido repetido

source: Use $item to remove the current item in a repeated collection
es_es: Usa $item para quitar el elemento actual de una colección repetida

source: Use <a href="javascript:void(0);" open-help="filters" editor-mode="page">Filters</a> to format the data (e.g. <span ng-non-bindable>columnKey|uiDate</span>)
es_es: Utilice <a href="javascript:void(0);" open-help="filters" editor-mode="page"> Filtros</a> para formatear los datos (por ejemplo, <span ng-non-bindable> columnKey | uiDate</span>)

source: Use <b>widgets</b> from the palette on the left to <b>display information to</b> and <b>gather information from</b> the end users.
es_es: Usa los <b>widgets</b> de la paleta de la izquierda para <b>mostrar información</b> y <b>recopilar información</b> de los usuarios finales.

source: Use <code>legend</code> tag instead <code>label</code>
es_es: Usa la etiqueta <code>leyenda</code> en su lugar <code>etiqueta</code>

source: Use <span ng-non-bindable>{{dataVariable}}</span> to access data, and <a href="javascript:void(0);" open-help="filters" editor-mode="page">filters</a> to format it (e.g. <span ng-non-bindable>{{dateVariable|uiDate}}</span>)
es_es: Utilice <span ng-non-bindable>{{dataVariable}}</span> para acceder a los datos, y <a href="javascript:void(0);" open-help="filters" editor-mode="page"> filtros</a> para formatearlos (ej. <span ng-non-bindable>{{dateVariable|uiDate}}</span>)

source: Use a Business Object
es_es: Usar un objeto de negocio

source: Use a bidirectional field to specify a read-write binding between the property value and a variable.
es_es: Utilice un campo bidireccional para especificar un enlace de lectura y escritura entre el valor de la propiedad y una variable.

source: Use a dynamic value field to specify a constant (the default) or an expression. Click the expression icon fx to switch from constant to expression. Click the constant icon X to switch from expression to constant. An expression can include a variable to make the property value dynamic, or can simply be the name of a variable. You can apply a filter to a variable value using a pipe. The binding to the variable is a read. If you want to write to the variable, use a bidirectional bond. Examples:
es_es: Utilice un campo de valor dinámico para especificar una constante (valor predeterminado) o una expresión. Haga clic en el icono de la expresión fx para cambiar de constante a expresión. Haga clic en el icono de constante X para cambiar de expresión a constante. Una expresión puede incluir una variable para hacer dinámico el valor de la propiedad, o puede ser simplemente el nombre de una variable. Puede aplicar un filtro a un valor de la variable usando pipe '|'. El enlace a la variable es de lectura. Si desea escribir en la variable, utilice un vínculo bidireccional. Ejemplos:

source: Use an interpolation field to enter text to display in the widget. The text can include variables that are interpreted using AngularJS interpolation. When the page is displayed, the variables are replaced by the interpolated values. Specify a variable as a simple expression enclosed in double braces, using the same format as for a dynamic value field. Example: I'm sorry, <em ng-non-bindable>{{ user.name | uppercase }}</em>. I'm afraid I can't do that.
es_es: Usa un campo de interpolación para introducir texto para mostrar en el widget. El texto puede incluir variables que se interpretan usando interpolación AngularJS. Cuando se muestra la página, las variables son reemplazadas por los valores interpolados. Especifique una variable como una expresión simple encerrada en dos llaves, usando el mismo formato que para un campo de valor dinámico. Ejemplo: Lo siento, <em ng-non-bindable>{{ user.name | uppercase }}</em>. Temo que no pueda hacerlo.

source: Use basic html tags (if allowed), <span ng-non-bindable>{{dataVariable}}</span> to access data, and <a href="javascript:void(0);" open-help="filters" editor-mode="page">filters</a> to format it (e.g. <span ng-non-bindable>{{dateVariable|uiDate}}</span>)
es_es: Utilice etiquetas HTML básicas, <span ng-non-bindable>{{dataVariable}}</span> para acceder a los datos, y <a href="javascript:void(0);" open-help="filters" editor-mode="page"> filtros</a> para formatearlos (ej. <span ng-non-bindable>{{dateVariable|uiDate}}</span>)

source: Use the <em>ui-translate</em> directive in custom widgets for static content to be translated
es_es: Use la directiva <em>ui-translate</em> en los widgets personalizados para traducir contenido estático

source: Use the <em>uiTranslate</em> filter in custom widgets for dynamic content to be translated
es_es: Use el filtro <em>uiTranslate</em> en los widgets personalizados para traducir contenido dinámico

source: Use the UI Designer to create or edit web artifacts: <b>application pages</b> composing business applications, <b>process forms</b> linked to process instantiation or human tasks execution, as well as <b>application layouts</b>, applied to all pages of a business application.
es_es: Utiliza el UI Designer para crear o editar artefactos web: <b>páginas de una aplicación</b> que conforman las aplicaciones de negocio, <b>formularios de proceso</b> vinculados con la creación de instancias de proceso o ejecución de tareas humanas, así como <b>layouts de una aplicación</b>, aplicados a todas las páginas de una aplicación de negocios.

source: Use the characters: H (hour), h (hour in AM/PM), m (minutes) and optionally s (seconds), a (AM/PM)
es_es: Utilice los caracteres: H (hora), h (hora en formato AM/PM), m (minutos) y, opcionalmente, s (segundos), a (AM/PM)

source: Use the characters: M (month), d (day), y (year)
es_es: Utilice los caracteres: M (mes), d (día), y (año)

source: Use the generated user interface
es_es: Utilice la interfaz de usuario generada

source: Use the palette on the left to drag and drop containers and widgets in the whiteboard.
es_es: Utiliza la paleta de la izquierda para arrastrar y soltar contenedores y widgets en el whiteboard.

source: Use this container to create a pop-in window which can be opened or closed with a button, and displayed over the page, form, or layout content.
es_es: Utilice este contenedor para crear una ventana modal que puede ser abierta o cerrada desde un botón, y mostrar contenido tanto en páginas, formularios o layouts.

source: Use this widget to select a date (e.g., a date of birth).
es_es: Use este widget para seleccionar una fecha (por ejemplo, fecha de nacimiento).

source: Use this widget to select a date and a time (e.g., to schedule a meeting).
es_es: Use este widget para seleccionar una fecha y una hora (por ejemplo, planificar una cita).

source: Use this widget to:
es_es: Usar este widget para:

source: Use your Business data
es_es: Utiliza tus datos de negocio

source: Used in the portal list of Resources. Part of the page.properties descriptor in the exported page archive.
es_es: Utilizado en la lista de Recursos del portal. Parte del descriptor page.properties en el archivo de páginas exportadas.

source: Used in the portal list of Resources. Part of the page.properties descriptor in the exported page archive. If empty, page technical name is used as fallback.
es_es: Utilizado en la lista de recursos del portal. Parte del descriptor de page.properties en el archivo de página exportada. Si está vacío, el nombre técnico de la página se utiliza por defecto.

source: User id could then be obtained by using {{myData.user_id}}
es_es: La Id de usuario se obtendría mediante el uso de {{myData.user_id}}

source: Using the Vertical Display property, it is possible to display tabs vertically or horizontally.
es_es: Usando la propiedad de Visualización Vertical, es posible mostrar pestañas vertical u horizontalmente.

source: Validation Errors
es_es: Errores de validación

source: Validation error on the page. Fix is recommended before export
es_es: Error de validación en la página. Se recomienda corregirlo antes de la exportación

source: Validation error. Fix is recommended before export
es_es: Error de validación. Se recomienda corregirlo antes de la exportación

source: Value
es_es: Valor

source: Value Format
es_es: Formato del valor

source: Value max length
es_es: Longitud máxima

source: Value min length
es_es: Longitud mínima

source: Value must be unique
es_es: El valor debe ser único

source: Value to add
es_es: Valor a agregar

source: Variable content formatted in HTML
es_es: Contenido de la variable formateada en HTML

source: Variable for frontend paging and ordering or Bonita REST API URL for backend paging and ordering
es_es: Variable para paginación y ordenación en el frontend; "Bonita REST API URL" para la paginación y la ordenación en el backend

source: Variable in read-write binding with the property value
es_es: Variable en enlace de lectura y escritura con valor de la propiedad

source: Variable name
es_es: Nombre de Variable

source: Variable names must start with a letter and contain only alphanumeric characters
es_es: Los nombres de las variables deben empezar con una letra y contener sólo caracteres alfanuméricos

source: Variable of type array
es_es: Variable de tipo array

source: Variables can be bound to input fields to create conditional behavior between widget properties.
es_es: Las variables pueden estar enlazadas a los campos de entrada para crear un comportamiento condicional entre las propiedades del widget.

source: Vertical display
es_es: Display Vertical

source: View
es_es: Ver

source: View asset content
es_es: Ver recurso

source: View in application <i class="fa fa-info-circle ng-scope" uib-tooltip="{{'In case your application is not available, please log in using a different account' | translate}}" tooltip-placement="bottom" tooltip-append-to-body="true"></i>
es_es: Ver en la aplicación <i class="fa fa-info-circle ng-scope" uib-tooltip="{{'In case your application is not available, please log in using a different account' | translate}}" tooltip-placement="bottom" tooltip-append-to-body="true"></i>

source: View...
es_es: Ver...

source: W3C website
es_es: Sitio web de W3C

source: We have reorganized the order of the fields contained in the json file in order to facilitate the file comparison.
es_es: Hemos reorganizado el orden de los campos contenidos en el archivo json para facilitar la comparación de archivos.

source: When 'Content' is a list of objects, specifies the attributes to display in the table columns. These keys must not be a number, or start with a number
es_es: Cuando 'Contenido' es una lista de objetos, especifica los atributos a mostrar en las columnas de la tabla. Estas claves no deben ser un número, o comenzar con un número

source: When possible, properties of the target widget are mapped with similar properties of the source widget. You can edit that and map more.
es_es: Cuando sea posible, las propiedades del widget objetivo se mapean con propiedades similares del widget de origen. Puede editar eso y mapear más.

source: When sent in the JSON body of a request, it is serialized into an ISO 8601 formatted String variable with the time set to midnight UTC (e.g., 2016-12-31T00:00:00.000Z).
es_es: Cuando se envía en el cuerpo JSON de una request, se serializa en una variable String con formato ISO 8601 con el tiempo establecido a medianoche UTC (por ejemplo, 2016-12-31T00:00:00.000Z).

source: When the switch is completed, chances are you will still have properties to fill out, in the properties panel.
es_es: Cuando el cambio se complete, puede ser que todavía tenga propiedades para completar en el panel de propiedades.

source: When the table is displayed, each time the user updates the filter, the table display is updated accordingly. The filter is applied to the table rows that are currently displayed.
es_es: Cuando la tabla es mostrada, cada vez que el usuario actualiza el filtro, la tabla es actualizada según la selección. El filtro es aplicado a las columnas de la tabla que se encuentran mostradas.

source: When using a version control system, like git for example, migrating to this last version may cause reorder changes in json models that must be pushed.
es_es: Cuando se utiliza un sistema de control de versiones, como por ejemplo git migrar a esta última versión puede causar cambios en los modelos json que deben ser empujados.

source: When you delete a row, the following rows move up
es_es: Cuando se elimina una fila, las siguientes filas suben

source: When you drag and drop a widget or a fragment, some Bonita resources are automatically found and added in the Bonita resource table. The <code>scopes</code> column of the Bonita resources table helps you identify what artifact declare a given resource.
es_es: Cuando arrastra y suelta un widget o un fragmento, algunos recursos de Bonita se encuentran automáticamente y se agregan en la tabla de recursos de Bonita. La columna de <code>alcances</code> de la tabla de recursos de Bonita te ayuda a identificar qué artefacto declara un recurso determinado.

source: When you generate a form from a contract in the Studio, the form contains a Submit button and some default variables: <code>formInput</code>, <code>formOutput</code>, <code>taskId</code>, and <code>context</code>
es_es: Cuando se genera un formulario desde un contrato en el Studio, el formulario contiene un botón Enviar y algunas variables predeterminadas: <code>formInput</code>, <code>formOutput</code>, <code>taskId</code> y <code>context</code>

source: Whenever this form is reloaded, either by hitting F5 or browsing away and back again, the entry will be reloaded automatically from LocalStorage.
es_es: Cada vez que se vuelve a cargar este formulario, o sea por teclear F5, o sea por navegar lejos y volver otra vez, la entrada se recargará automáticamente desde el LocalStorage.

source: Where businessDataType = com.company.model.MyData, queryName = name of the BDM query, filter = "myParam=myValue"
es_es: Donde businessDataType = com.company.model.MyData, queryName = nombre de la consulta BDM, filter = "myParam = myValue"

source: Where businessVariableName is the name of the business variable defined at pool level.
es_es: Donde businessVariableName es el nombre de la variable de negocio a nivel de Pool.

source: Widget description
es_es: Descripción del widget

source: Widget implementation is based on the AngularJS framework.
es_es: La implementación del widget se basa en el framework AngularJS.

source: Widget properties defined on the right can be used as variables in a controller with $scope.properties.
es_es: Las propiedades del widget definidas en la derecha pueden ser utilizadas como variables en un controlador con $scope.properties.

source: Widget properties defined on the right can be used as variables in a template with properties.newProperty.
es_es: Las propiedades del widget definidas en la derecha pueden ser utilizadas como variables en una plantilla con properties.newProperty.

source: Widgets use the l10n mechanism that loads the translated string during page start up.
es_es: Los widgets utilizan el mecanismo de l10n que carga la cadena traducida durante el comienzo de carga de la página.

source: Width
es_es: Ancho

source: Will be retrieved from the URL if not set ('app' parameter). You can pass it in the query string of the preview URL for tests.
es_es: Será obtenido de la dirección URL si no ha sido establecido (parámetro 'app'). Puede pasarlo en la cadena de consulta de la dirección URL de la vista previa a modo de prueba.

source: With this widget, you can display data from an array in tabular presentation.
es_es: Con este widget, puede mostrar datos de un array en una presentación tabulada.

source: Within a row, when you delete a widget or a container, the following elements move to the left
es_es: Dentro de una fila, al eliminar un widget o un contenedor, los siguientes elementos se desplazan hacia la izquierda

source: Yes
es_es: Sí
