Repository: bonitasoft/bonita-ui-designer-artifact-builder
Catalog: artifact-builder/src/main/resources/i18n/lang-template-*.po
Languages: es_es

source: The changes will automatically be available when changing a page in Bonita UI Designer <2023.1> developed with a previous Bonita UI Designer version. Custom styling could be impacted so take this fact into account in your development estimates.</2023.1>
es_es: Los cambios estarán disponibles automáticamente al cambiar una página en Bonita UI Designer <2023.1> desarrollado con una versión anterior de Bonita UI Designer. El estilo personalizado puede ser impactado, así que tenga en cuenta este hecho en sus estimaciones de desarrollo.</2023.1>

source: The character separator to the fraction
es_es: El separador de caracteres para la fracción

source: The character used as the thousands separator
es_es: El carácter usado como el separador de miles

source: The content of <em>Label</em>, <em>Technical date format</em>, <em>Placeholder</em> properties, as well as the label of button <em>Today</em> are localized by default. Localized format can be edited in the asset <em>localization.json</em>.
es_es: El contenido de las propiedades de <em>Etiqueta</em>, <em>Formato técnico de fecha</em>, <em>Placeholder</em>, así como la etiqueta del botón <em>Hoy</em> están localizados por defecto. El formato localizado puede ser editado en el activo <em>localization.json</em>.

source: The content of <em>Label</em>, <em>Technical date formats</em>, <em>Placeholder</em> properties, as well as the labels of buttons <em>Today/Now</em> are localized by default. Localized formats can be edited in the asset <em>localization.json</em>.
es_es: El contenido de las propiedades de <em>Etiqueta</em>, <em>Formato técnico de fecha</em>, <em>Placeholder</em>, así como las etiquetas de los botones <em>Hoy/Ahora</em> están localizados por defecto. Los formatos localizados pueden ser editados en el activo <em>localization.json</em>.

source: The controller is a JavaScript function that augments the AngularJS scope and exposes functions that can be used in the widget template.
es_es: El controlador es una función JavaScript que aumenta el alcance AngularJS y expone funciones que pueden ser usadas en la plantilla de widget.

source: The default application layout will retrieve the <em>Target URL on success</em> that was sent in the message and set its window location with it.
es_es: El layout por defecto de la aplicación recupera la <em>Dirección URL de destino en éxito</em> que fue enviada en el mensaje y establece su ubicación de la ventana con ella.

source: The default widgets in the palette that contain a html <code>input</code> tag have now an associated label, which will facilitate the use of computer tools (screen readers for example)
es_es: Los widgets por defecto en la paleta que contienen una etiqueta html <code>input</code> tienen ahora una etiqueta asociada, que facilitará el uso de herramientas informáticas (lectores de pantalla por ejemplo)

source: The display of dates and times relies on the user's browser time zone. Therefore, displayed values are different from stored values (except in the GMT time zone).
es_es: La muestra de fechas y horas depende de la zona horaria del navegador del usuario. Por lo tanto, los valores difieren de los valores almacenados (excepto en la zona horaria GMT).

source: The following documentation applies if you need to handle the behavior on success yourself (e.g. if you build your own tasklist or any page with an iframe to display forms).
es_es: La siguiente documentación se aplica si se necesita manejar el comportamiento en el éxito (por ejemplo, si se construye su propia lista de tareas o cualquier página con un iframe para mostrar formularios).

source: The following improvements have been made so that digitally accessible applications could be developed natively with Bonita UI Designer with less custom code:
es_es: Se han realizado las siguientes mejoras para que las aplicaciones digitalmente accesibles puedan desarrollarse nativamente con Bonita UI Designer con un código menos personalizado:

source: The hex codes for the sector colors for single set charts, or for the set colors for multiple set charts. If not specified, default colors are used
es_es: Códigos hexadecimales de los colores del sector para las gráficas simples, o de los colores establecidos para las gráficas múltiples. Si no se especifica, se utilizan los colores por defecto

source: The imported {{ ::importReport.type }} also contains new elements.
es_es: El {{ ::importReport.type }} importado también contiene nuevos elementos.

source: The input/output of the widget (its <em>Value</em>) is an <a href="https://en.wikipedia.org/wiki/ISO_8601" target="_blank">ISO 8601</a> formatted String variable.
es_es: La entrada y la salida del widget (su <em>Valor</em>) es una variable de tipo String con formato <a href="https://en.wikipedia.org/wiki/ISO_8601" target="_blank">ISO 8601</a>.

source: The legend shows the sector labels for single set charts, and the set labels for multiple set charts
es_es: La leyenda muestra las etiquetas de sector para las gráficas simples y las etiquetas establecidas para las gráficas múltiples

source: The link text which is static is translated using the <em>ui-translate</em> directive. The link text title held inside the <em>properties.title</em> variable is translated using the <em>uiTranslate</em> filter.
es_es: El texto del enlace que es estático es traducido usando la directiva <em>ui-translate</em>. El título del texto del enlace contenidos dentro de la variable <em>properties.title</em> se traduce utilizando el filtro <em>uiTranslate</em>.

source: The list contains page assets, the assets of the widgets used in this page and assets used by base framework.
es_es: La lista contiene assets de páginas, los assets de los widgets utilizados en esta página y assets utilizados por el framework base.

source: The modal size can be selected in the container <em>Size</em> properties. Options available are small, medium or large, which will control the width of the modal.
es_es: El tamaño de la modal puede ser seleccionado en la propiedad <em>Tamaño</em> del contenedor. Las opciones disponibles son pequeño, mediano, o grande, lo cual gestionará la anchura de la modal.

source: The modal style can be improved by using the <em>modal-body</em> specific class into the <em>CSS Classes</em> property field.
es_es: El estilo de la modal puede ser mejorado utilizando la clase especifica <em>modal-body</em> en la propiedad <em>CSS Classes</em>.

source: The name of the key to use as label. Can be empty
es_es: El nombre de la clave a utilizar como etiqueta. Puede estar vacío

source: The name of the key to use as value. Leave it empty for whole object
es_es: El nombre de la clave para usar como valor. Dejar vacío para tener todo el objeto

source: The page has not been imported.
es_es: La página no ha sido importada.

source: The portal and tasklist will redirect to the process list (<em>Start process</em> action) or refresh the task list (<em>Submit task</em> action).
es_es: El portal y la lista de tareas se redirijirá a la lista de procesos (acción <em>Iniciar proceso</em>) o actualizar la lista de tareas (acción <em>Enviar tarea</em>).

source: The position of the currency symbol
es_es: La posición del símbolo de la moneda

source: The property <em>Value to add</em> can either be a JavaScript Object or a String depending on the format expected for the collection you are building.
es_es: La propiedad <em>Valor a agregar</em> puede ser un objeto de JavaScript o un String dependiendo del formato esperado de la colección que está construyendo.

source: The resources on completion are not exhaustive. You can set any other value.
es_es: Los recursos a completar no son exhaustivos. Puede establecer cualquier otro valor.

source: The scale labels for the x-axis for line and bar charts, ray labels for a radar chart, sector labels for single set charts
es_es: Etiquetas del eje-x para gráficas de línea y de barras, etiquetas de rayo para un gráfico de radar, etiquetas de sector para gráficas simples

source: The sort is backend when datasource is Bonita API. It is frontend, otherwise.
es_es: El orden es realizado desde el backend cuando la fuente de datos es Bonita API. En cualquier otro caso, es realizado desde el frontend.

source: The switch widget feature has been improved to guide the user efficiently to avoid incompatible properties mapping that may lead to inconsistent states of widgets.
es_es: Se ha mejorado la función de cambio de widgets para guiar al usuario de forma eficiente a fin de evitar el mapeo de propiedades incompatibles que pueden llevar a estados inconsistentes de los widgets.

source: The tab's properties allows you to customize default display and behaviour of tabs based on data and/or JS expressions.
es_es: Las propiedades de la pestaña le permiten personalizar la visualización por defecto y el comportamiento de las pestañas basándose en datos y/o expresiones JS.

source: The tooltip will be display as such, close to the property label.
es_es: La ayuda se mostrará como tal, cerca de la etiqueta de propiedad.

source: The values of all properties are also used as translation keys. As a result, if you choose not to keep the default values, update the asset <em>localization.json</em> accordingly.
es_es: Los valores de todas las propiedades también se utilizan como claves de traducción. Por tanto, si no desea mantener los valores por defecto, actualice el activo <em>localization.json</em> en consecuencia.

source: The whiteboard is organized in <b>rows</b> that you can move up and down, or delete.
es_es: El whiteboard está organizado en <b>filas</b> que se pueden mover arriba y abajo, o eliminar.

source: The widget HTML template is defined here.
es_es: La plantilla HTML del widget se define aquí.

source: The widget has not been imported.
es_es: El widget no se ha importado.

source: The {{ ::importReport.overwrittenType }} <strong>{{ ::importReport.overwrittenName }}</strong> will be overwritten.
es_es: Se sobrescribirá la {{ ::importReport.overwrittenType }} <strong>{{ ::importReport.overwrittenName }}</strong>.

source: The {{ ::importReport.type }} to import contains elements with the same Id as some existing elements.
es_es: El {{ ::importReport.type }} a importar contiene elementos con el mismo id que otros elementos existentes.

source: The {{ artifact.type }} cannot be deleted because it is used in:
es_es: El {{ artifact.type }} no se puede eliminar porque es utilizado en:

source: The {{ artifactType }} has not been imported.
es_es: El {{ artifactType }} no ha sido importado.

source: Then, provide a comma-separated list for the columns keys indicating the attribute to display in each column.
es_es: Luego, proporcione una lista de las claves de columnas, separadas por coma, indicando el atributo a mostrar en cada columna.

source: There is a set of <b>default widgets</b> for displaying information to and for gathering information from the end users. You can also create <b>custom widgets</b>.
es_es: Hay un conjunto de <b>widgets por defecto</b> para mostrar información y para recogida de información de los usuarios finales. También se pueden crear <b>widgets personalizados</b>.

source: This Business Object contains more than {{number}} levels of relations. {{numberAsText}} level and beyond will not appear.
es_es: Este Business Object contiene más de {{number}} niveles de relaciones. El nivel {{numberAsText}} y más profundo no aparecerán.

source: This description will be displayed as a tooltip in the palette
es_es: Esta descripción se mostrará como un tooltip en la paleta

source: This example uses the JSON example provided if you select the type JSON.<br> It looks for the string ‘Linux’ in the array <code>environment</code> of JSON object <code>supportTicket</code>
es_es: Este ejemplo utiliza el ejemplo JSON proporcionado si seleccionas el tipo JSON. <br>Busca la cadena 'Linux' en el array <code>environment</code> del objeto JSON <code>supportTicket</code>

source: This feature is not available on Internet Explorer 11 nor Microsoft Edge for the moment.
es_es: Esta característica no está disponible en Internet Explorer 11 ni Microsoft Edge por el momento.

source: This filter uses the <a href="http://momentjs.com/">moment.js</a> library to transform the display of a relative time. For example, it transforms '01/01/2011' to '4 years ago'.
es_es: Este filtro utiliza la librería <a href="http://momentjs.com/"> moment.js</a> para transformar la visualización de un tiempo relativo. Por ejemplo, transforma el '01/01/2011 ' en 'hace 5 años'.

source: This modal is based on ui-bootstrap implementation. It is possible to change the size or the style of the modal.
es_es: La modal está basada en la implementación ui-bootstrap. Es posible modificar el tamaño y/o estilo de la modal.

source: This name already exists
es_es: El nombre ya existe

source: This page allows you to view a standard widget, or edit a custom widget.
es_es: Esta página le permite ver un widget estándar, o editar un widget personalizado.

source: This page is empty.
es_es: Esta página está vacía.

source: This panel displays the list of Business Objects that has been defined and deployed using Bonita Studio.
es_es: Este panel muestra la lista de Business Objects que se ha definido y desplegado usando Bonita Studio.

source: This widget can be used to display/update business variable attributes defined in the Business Data Model (BDM) with the following types:
es_es: Este widget se puede utilizar para mostrar/actualizar atributos de variables de negocio definidos en el modelo de datos de negocio (BDM) con los siguientes tipos:

source: This widget supports the following types for its <em>Value</em> property as input:
es_es: Este widget soporta los siguientes tipos por su propiedad de <em>Valor</em> como entrada:

source: This will also update the content of the preview window
es_es: También se actualizará el contenido de la ventana de previsualización

source: Thousands separator
es_es: Separador de miles

source: Time Placeholder
es_es: Placeholder de la hora

source: Title
es_es: Título

source: Title level
es_es: Nivel de título

source: To Display the tab vertically and on the left of the content, you can read this <a href="https://www.bonitasoft.com/bos_redirect.php?bos_redirect_id=712&bos_redirect_product=bos&bos_redirect_major_version=7.10">how to learn more about customization</a>
es_es: Para mostrar la pestaña verticalmente y a la izquierda del contenido, puedes leer <a href="https://www.bonitasoft.com/bos_redirect.php?bos_redirect_id=712&bos_redirect_product=bos&bos_redirect_major_version=7.10">cómo aprender más sobre personalización</a>

source: To add content, drag and drop components from the palette to the whiteboard above.
es_es: Para agregar contenido, arrastra y suelta los componentes de la paleta en la zona de trabajo.

source: To allow your user to download a document add a link widget with its url property bound to
es_es: Para permitir a los usuarios descargar un documento, añade un widget Link con la propiedad url configurada con

source: To avoid some HTML injection in your page/form, we put for <b>Interpret HTML</b> property the default value to false for all widgets. If you already put this property to true, nothing change for you.
es_es: Para evitar alguna inyección HTML en su página/formulario, pusimos para la propiedad <b>Interpretar HTML</b> el valor predeterminado a falso para todos los widgets. Si usted ya pone esta propiedad a verdadero, nada cambia para usted.

source: To avoid them being overwritten, <i>rename</i> them before you import.
es_es: Para evitar que se sobrescriban, <i>renombre</i> ellos antes de importarlos.

source: To be more accessible for speech synthesizers, screen readers or some other tools, the internal html template of checklist and radio buttons widget has been updated.
es_es: Para ser más accesible para sintetizadores de voz, lectores de pantalla u otras herramientas, la plantilla HTML interna de los botones de lista de verificación y radio ha sido actualizada.

source: To close a modal window, put a button inside the modal that you wish to close and select the <em>Close modal</em> action.
es_es: Para cerrar una modal, añada un boton dentro de la modal y seleccione la acción <em>Cerrar modal</em>.

source: To control modal containers, the following methods are available in a button:
es_es: Los siguiente métodos están disponibles en el botón para manejar los contenedores modal:

source: To control modal containers, the following methods are supported:
es_es: Los siguiente métodos están disponibles para manejar los contenedores modal:

source: To define the tab selected by default
es_es: Para definir la pestaña seleccionada por defecto

source: To display (and not update) a date and a time retrieved from the BDM API (or another API), you can either use this <em>Date time picker</em> widget with <em>Read-only</em> property set to "yes" or use a <em>Text</em>, <em>Title</em> or a <em>Table</em> widget and format the value using the provided <em>uiDate</em> <a href="javascript:void(0);" open-help="filters" editor-mode="page">filter</a>.
es_es: Para mostrar (y no actualizar) una fecha y una hora obtenidas de la API BDM (u otra API), puede utilizar este widget de <em>Selector de fecha y hora</em> con la propiedad <em>Sólo lectura</em> establecida a "sí" o utilizar un widget de <em>Texto</em>, <em>Título</em> o <em>Tabla</em> y dar formato al valor con el <a href="javascript:void(0);" open-help="filters" editor-mode="page"> filtro</a> <em>uiDate</em> proporcionado.

source: To display (and not update) a date retrieved from the BDM API (or another API), you can either use this <em>Date picker</em> widget with <em>Read-only</em> property set to "yes" or use a <em>Text</em>, <em>Title</em> or a <em>Table</em> widget and format the value using the provided <em>uiDate</em> <a href="javascript:void(0);" open-help="filters" editor-mode="page">filter</a>.
es_es: Para mostrar (y no actualizar) una fecha obtenida de la API BDM (u otra API), puede utilizar este widget de <em>Selector de fecha</em> con la propiedad <em>Sólo lectura</em> establecida a "sí" o utilizar un widget de <em>Texto</em>, <em>Título</em> o <em>Tabla</em> y dar formato al valor con el <a href="javascript:void(0);" open-help="filters" editor-mode="page"> filtro</a> <em>uiDate</em> proporcionado.

source: To display the data, define the header properties with a comma-separated list of column headings, bind the content to an array of JavaScript objects.
es_es: Para mostrar los datos, establezca las propiedades de los encabezados de columnas, con una lista separadas por coma, enlace el contenido a un array de objetos JavaScript.

source: To display the date in a widget property evaluated as an expression, use the <code>dateAgo</code> filter on the <code>updateDate</code> variable as follows: <code>updateDate | dateAgo</code>
es_es: Para mostrar la fecha en una propiedad de widget evaluada como una expresión, utilice el filtro de <code>dateAgo</code> en la variable <code>updateDate</code> como sigue: <code>updateDate | dateAgo</code>

source: To edit a custom widget, use the <b>Edit</b> menu option close to the widget name in the properties panel.
es_es: Para editar un widget personalizado, utilice la opción del menu <b>Edición</b> cerca del nombre del widget en el panel de propiedades.

source: To edit this standard widget, save it first as a new custom widget
es_es: Para editar este widget estándar, guárdalo primero como un nuevo widget personalizado

source: To embed a pop-in into another pop-in at runtime, drop the first modal container at the bottom, drop the second modal container below the first one, and drop the button that opens the second pop-in within the first modal container.
es_es: Para embeber una modal dentro de otra modal en tiempo de ejecución, añada la primera modal al final, añada la segunda modal debajo de la primera, añada un botón en la primera modal que abra la segunda modal.

source: To extend a page or form with custom AngularJS services (such as filters, constants, or factories), use the <code>bonitasoft.ui.extensions</code> module.
es_es: Para ampliar una página o formulario con servicios personalizados de AngularJS (como filtros, constantes o factorías), utiliza el módulo <code>bonitasoft.ui.extensions</code>.

source: To get data from the <i>Business Data Model</i>, please use the Business data variable type.
es_es: Para obtener datos del <i>Modelo de Datos de Negocio</i>, utilice el tipo de variable de Datos de Negocio.

source: To get the data from a selected row, bind selected row to a variable.
es_es: Para recuperar los datos de una fila seleccionada, vincule el parametro "fila seleccionada" a una variable.

source: To keep things working, if you migrate a page designed in a version older than 7.5.0 and containing custom widgets, <em>ui-bootstrap-tpls-0.13.0.min.js</em> will be added as an asset of your page automatically. You can remove it if you don't need it.
es_es: Para mantener las paginas funcionando, si migras una página diseñada en una versión anterior a 7.5.0 que contiene custom widgets, se añadirá el fichero <em>ui-bootstrap-tpls-0.13.0.min.js</em> automáticamente a la página. Puede eliminarlo si no lo necesita.

source: To load a local image asset in a custom widget, you need to reference it in the template inside a <code>&lt;img&gt;</code> tag with a relative path as follows: <br><code ng-non-bindable>&lt;img src="widgets/[custom widget id]/assets/img/[image name]"&gt;</code>
es_es: Para cargar un asset local de imagen en un widget personalizado, necesita hacer referencia en la plantilla dentro de una etiqueta <code>&lt;img&gt;</code> con una ruta relativa como sigue: <br><code ng-non-bindable>&lt;img src="widgets/[custom widget id]/assets/img/[image name]"&gt;</code>

source: To load an image for any custom widget, add image assets at page level. Access it with <code>asset/img/[image name]</code>.
es_es: Para cargar una imagen para cualquier widget personalizado, añade un recurso de imagen a nivel de página. Accede a él con <code>asset/img/[nombre imagen]</code>.

source: To manage multiple version of dependencies, make sure only one version of an asset is active inside a page.
es_es: Para administrar múltiples versiones de dependencias, asegúrese de que sólo una versión de un recurso está activa dentro de una página.

source: To open a modal window it is enough to input a modal ID in the properties, to create a button, select <em>Open modal</em> in the Action property, and fill in the right modal ID. The button should be located outside of the modal container.
es_es: Para abrir una modal es suficiente con declarar un modal ID en la propiedades, añadir un botón, seleccione <em>Abrir modal</em> en la propiedad acción, y configure el modal ID. El botón debe ubicarse fuera del contenedor modal.

source: To pre-fill with a template, bind an HTML formatted variable
es_es: Para pre-rellenar con una plantilla, enlaza una variable con formato HTML

source: To retrieve a document instance, create an External API variable with value
es_es: Para devolver una instancia de documento, crea una variable External API con valor

source: To save <strong>{{ ::importReport.overwrittenName }}</strong> with a different identifier, <i>rename</i> it before you import.
es_es: Para guardar <strong>{{ ::importReport.overwrittenName }}</strong> con un identificador diferente, <i>cámbiele</i> el nombre antes de importarlo.
